{
  "unit_name": "Unit 15 - Domestic appliances",
  "unit_number": 15,
  "category": "G2",
  "editions": {
    "8th_2025": {
      "unit_name": "Unit 15 - Domestic appliances",
      "edition": "8th Edition",
      "publication_date": "June 2025",
      "is_primary": true,
      "category": "G2",
      "total_chapters": 4,
      "total_pages": 132,
      "chapters": [
        {
          "chapter_number": 1,
          "chapter_name": "Ranges",
          "pages": "6-16",
          "topics": [
            "Types of gas ranges (free-standing, built-in, combination units)",
            "Dual fuel units (propane or natural gas)",
            "Self-cleaning feature (high temperature cycle, door lock)",
            "Continuous cleaning feature",
            "Broiler units (separate burner on top of oven)",
            "Warming drawers",
            "Heat transfer methods (convection, conduction, radiation)",
            "Natural convection oven (50°F temperature variation)",
            "Forced convection oven (fan circulation)",
            "Manufacturer specifications and rating plate",
            "Input rating (Btu/h or kW)",
            "Approval and certification (CSA Group)",
            "Operating voltage and current (110V supply)",
            "Operating pressure (inlet vs manifold pressure)",
            "Appliance pressure regulator",
            "Typical inlet pressure: 7 in w.c. (1.5 kPa) natural gas, 11 in w.c. (2.7 kPa) propane",
            "Typical manifold pressure: 3.5-5 in w.c. (0.9-1.25 kPa) natural gas, 10 in w.c. (2.5 kPa) propane",
            "Regulator adjustment for fuel conversion",
            "Code requirements (CSA B149.1)",
            "Electrical connections (120V, 60Hz, No. 14 AWG NMD-90)",
            "Three-prong grounding plug (no extension cords)",
            "Piping connections (rigid or flexible connectors)",
            "Flexible metal connectors (6 ft maximum length)",
            "Shut-off valve requirements",
            "Prohibited practices (no bushings nested, no field bending, no street elbows)",
            "Certified flexible metal connectors for movement",
            "Quick-disconnect devices (not permitted indoors residential)",
            "Restraining cable for commercial equipment on wheels",
            "General considerations (levelling, anti-tipping devices)",
            "Installation in bedroom prohibited (CO risk)",
            "Clearance to combustibles (150mm back and sides if not specified)",
            "Combustible cabinet protection (28 MSG metal shield, 0.25 in spacing)",
            "Zero clearance range requirements",
            "No combustibles within 30 in (750mm) above range top",
            "Protected combustibles may be within 24 in (600mm)",
            "1-in (25mm) space between back of range and combustible surface",
            "Power supply and polarization testing (120V checks)",
            "Fuel conversion procedures",
            "Orifice sizing",
            "Drill measurement system (DMS)"
          ],
          "content": "Chapter 1 covers the installation, types, features, and code requirements for gas-fired domestic ranges.\n\nTYPES OF GAS RANGES:\n\n1. FREE-STANDING RANGES:\nFree-standing means they are not built-in or permanently installed. Most residential service gas-fired ranges are 24 to 30 in wide, free-standing units with integral oven.\n\n2. BUILT-IN RANGES:\nBuilt-in ranges are permanently installed as part of kitchen cabinetry. A gas-fired wall oven is separate built-in unit installed and operated independently from drop-in countertop cooktop unit.\n\n3. GAS AND ELECTRIC COMBINATION UNITS:\nGas and electric combination units offer gas stove top burners with electric oven options.\n\n4. DUAL FUEL UNITS:\nDual fuel gas ranges can run on propane or natural gas. Conversion is usually accomplished by means of adjustable orifice.\n\nMAJOR FEATURES OF GAS RANGES:\n\nSELF-CLEANING FEATURE:\nAn oven equipped with self-cleaning feature incinerates baked-on dirt in oven by heating to high temperature during cleaning cycle. For safety, oven door locks when cleaning cycle is selected and remains locked until oven cools after cleaning cycle ends.\n\nCONTINUOUS CLEANING FEATURE:\nIn continuous cleaning oven, dirt is baked off oven surfaces on continuous basis while food is cooking.\n\nBROILER:\nGas stoves formerly utilized oven burner to broil food. Lower drawer was opened to allow same oven burner to serve as broiler burner. Now, gas-fired ovens come with separate broiler units. Broiler is special burner located on top of oven. Heat from burner is directed downward towards food for broiling.\n\nWARMING DRAWER:\nSome gas-fired ovens also have warming drawers, which maintain cooked food at desired serving temperature.\n\nHEAT TRANSFER METHODS:\n\nThe three methods of heat transfer in cooking appliances are convection, conduction, and radiation.\n\n1. CONVECTION:\nTransfer of heat by heat currents. Ovens use one of two methods:\n\nNATURAL CONVECTION OVEN:\nWarm air rises and cool air descends. In standard, natural convection oven, hottest area is at top of oven and coolest is at bottom, no matter where burner is located. Thermostats can control burner on-off cycle within certain temperature range, but temperature may vary as much as 50°F from one area of oven to another. This makes it difficult to cook food evenly.\n\nFORCED CONVECTION OVEN:\nIn forced convection oven, fan circulates heat from burner evenly throughout oven. Circulating heat cooks food faster and more evenly than natural convection oven.\n\n2. CONDUCTION:\nTransfer of heat through direct contact. Example: pot of water on rangetop burner being heated through direct contact with burner flame.\n\n3. RADIATION:\nTransfer of heat by means of heat rays emitted from heat source. Overhead broiler burner employs this method.\n\nINSTALLATION REQUIREMENTS:\n\nBefore installing gas-fired range, review:\n- Manufacturer specifications\n- Applicable codes\n- Installation instructions\n\nMANUFACTURER SPECIFICATIONS:\nFound on model and serial number identification plate (rating plate) attached to appliance at factory. Rating plate includes:\n- Input rating (Btu/h or kW)\n- Approval by regulating authorities and agencies\n- Operating voltage and current\n- Operating pressure\n\nINPUT RATING:\nInput rating of appliance in Btu/h (or kW) is stamped on rating plate. Rating plate specifications allow appliance installer to determine correct pipe or tubing size for service and set burner inputs correctly.\n\nAPPROVALS:\nGas industry and governmental regulatory agencies must approve all gas appliances before manufacturer can sell them. Official logo, symbol, or seal indicating certification appears on rating plate. Certification symbols that must appear on rating plate of gas appliance sold in Canada include those of CSA Group.\n\nOPERATING VOLTAGE AND CURRENT:\nRange must only be connected to electrical circuit that conforms to operating voltage and current rating specified on identification plate. Although older gas stoves with few options could function with just gas supply hookup, most gas stoves require 110-V supply outlet to power clocks, ignition sources, programmable features, and oven lighting.\n\nOPERATING PRESSURE:\nGas supply pressure is normally higher than that required for burner operation. Appliance pressure regulator is used to reduce supply pressure to manifold pressure required at burner and maintain it at that level.\n\nImportant to maintain correct manifold pressure setting to avoid:\n- Delayed ignition\n- Sooting\n- Flashback\n- Extinction pop\n- Damage to components\n- Poor operating efficiency\n- Limit cycling\n\nTYPICAL PRESSURES:\n- Inlet to appliance regulator: 7 in w.c. (1.5 kPa) natural gas, 11 in w.c. (2.7 kPa) propane\n- Outlet (manifold) pressure: 3.5 to 5 in w.c. (0.9 to 1.25 kPa) natural gas, 10 in w.c. (2.5 kPa) propane\n\nRegulator is usually pre-adjusted for use with type of gas specified on rating plate and for specific outlet pressure. Many ranges come with regulator that is adjustable for use with propane or natural gas. If you are to use range with different gas, adjust regulator accordingly by changing position of simple converter fitting (reversing cap or spring and disc assembly) on regulator.\n\nIMPORTANT: Measure inlet pressure to appliance while it is firing at its rated input. If appliance is not firing, input pressure reading will be static. Static reading does not reflect pressure loss that results from gas flowing through system.\n\nInput pressure to appliance is measured with manometer or pressure gauge installed in tee fitting in supply line just before appliance.\n\nCODE REQUIREMENTS:\nAll range installations must conform to requirements of applicable building, gas, and electrical codes.\n\nELECTRICAL CONNECTIONS:\nMost gas ranges require electricity to power clocks, timers, and other control devices. Electrical connection is usually 120V, 60Hz, two-wire, and with ground. Minimum size and type of wire that can be used for 120-V, 15-A indoor appliance is No. 14 AWG NMD-90.\n\nAll electrical connections between appliance and building wiring must comply with applicable electrical codes. Connection of all electrical devices associated with appliance must follow manufacturer wiring diagram.\n\nRange must be connected to electrical circuit receptacle by means of approved power supply cord with three-prong grounding plug. Extension cords may not be used.\n\nIMPORTANT: Under no circumstances should grounding prong of power supply cord be removed or replaced with two-prong plug or adapter.\n\nPIPING CONNECTIONS:\nCode requirements for gas range piping and tubing connections can be found in CSA B149.1, Clause 6.\n\nRigid piping or flexible connectors may be used to connect ranges to gas supply. Metal (flexible) connectors must be installed in accordance with following code requirements:\n\n- Connectors must be protected from potential damage\n- Connectors must not pass through walls, floors, ceilings, or partitions\n- Connectors must be connected to rigid pipe or tubing in same area as appliance, with shut-off valve located in same room as appliance\n- Gas-fired appliance (range) must not be installed or operated in any location where it could create hazard\n- Gas-fired appliance (range) must not be installed in room where corrosive vapours may damage appliance or its venting system\n\nPROHIBITED PRACTICES:\nFollowing practices are prohibited for gas piping installations:\n- Defective sections of pipe or tubing must be replaced and not repaired\n- Bushings must not be nested (installed within one another)\n- Fittings with both left- and right-hand threads, thread protectors, or running threads must not be used\n- Concealed piping runs must not contain union or combination of fittings intended to act as swing joint\n- Field bending of piping is not permitted\n- Gas piping and tubing must not be used as electrical ground\n- Piping and tubing must not be used in lieu of electrical wiring, except for low-voltage control circuit, ignition circuit, or flame-detection device circuit incorporated into appliance\n- Piping must not contain street elbow or street tee\n\nFLEXIBLE METAL CONNECTORS:\nTo provide for movement of gas range in order to clean behind it, use certified flexible metal gas connector as final connection to manifold. Not proper practice to expect this level of movement to be accommodated for in loop of copper tubing supply. Certified flexible metal connectors are tested and certified for multiple bends and expansion.\n\nMay use flexible metal connectors to connect appliances that may be subject to vibration, expansion, contraction, or other movements that might damage or loosen rigid connection.\n\nFLEXIBLE CONNECTOR CONDITIONS:\n- Length of connector must not exceed 6 ft (2m)\n- When used to connect appliance to rigid piping, shut-off valve must be installed in piping immediately upstream of flexible connector\n- Gas valve must be in same room as gas-fired equipment, and connector must not be concealed within or run through any wall, floor, or partition\n- When commercial equipment is on rollers or wheels, it requires restraining cable 25mm shorter than flexible connector\n\nFlexible connectors certified for use on commercial ranges that are moved regularly for cleaning have additional outer protective coverings of stainless-steel braided wire and antimicrobial PVC coating. They also have swivel connections to further reduce stress at ends.\n\nFACILITATING REPAIRS:\nThings that can be done during initial installation to make future repairs easier:\n- Install flexible connector to allow movement of appliance\n- Install shut-off valve upstream and as close to appliance as practical\n- Install quick-disconnect device attached to flexible connector (not permitted for use indoors in residential building as per CSA B149.1, Clause 6.11.3)\n- Install restraining cable with clips for removal that only get removed after gas has been shut off and connector disconnected\n\nGENERAL CONSIDERATIONS:\n\nSPECIFIC INSTALLATION REQUIREMENTS:\n- Compliance with clearance to combustibles requirements\n- Access for cleaning, repairs, and servicing\n- Proper distance to venting hoods, flues, or ductwork\n- Proper positioning with respect to adjacent cabinets, countertops, and other appliances\n\nIMPORTANT: Never install range in bedroom because it might produce carbon monoxide (CO). However, you may install it in bed-sitting room if you will not use it as space heating appliance (CSA B149.1, Clause 7.33.1).\n\nLEVELLING:\nIf range is not levelled, fluids will not fill cooking containers properly. This may lead to overflow and spillage that could create fire or personal injury hazard.\n\nANTI-TIPPING DEVICES:\nSome ranges may come with anti-tipping devices. These devices, installed at time of installation, prevent accidental tipping of range. Devices may consist of chain connecting range to wall bracket or rigid bracket attached to back of range and secured to wall behind it.\n\nCLEARANCE TO COMBUSTIBLES:\nDifferent types of ranges have different clearance requirements. Storage cabinets and other combustibles must be installed at safe distance above cooking top of range, while rear and sidewalls of range may be approved for zero clearance.\n\nManufacturer instructions and rating plate specify approved clearance to combustibles distance for appliance. When not covered in manufacturer instructions or on rating plate, follow appliance clearance requirements found in Code, Clause 7. For example, if not specified by manufacturer, range would require minimum of 150mm of clearance on its back and sides from combustible surfaces.\n\nCombustible cabinets or walls located next to range cooking surface must be protected with 28 MSG (metal sheet gauge) metal shield, spaced out 0.25 in (6mm) from combustible surface and extending from 5 in (125mm) below to 30 in (750mm) above cooking surface.\n\nZERO CLEARANCE RANGE REQUIREMENTS (CSA B149.1, Clause 7.33.5):\n\n- COMBUSTIBLES ABOVE: No combustibles within 30 in (750mm) of top of range\n- COMBUSTIBLE SURFACE REDUCTION: Combustible surfaces protected by shield of 0.25 in (6mm) millboard covered with 28 GSG (0.3mm) sheet metal may be within 24 in (600mm) of top of range\n- SPACE BETWEEN BACK: At least 1-in (25mm) space between back of range and combustible surface\n\nPOWER SUPPLY AND POLARIZATION:\nRanges equipped with electric components require power supply cord with three-prong grounded plug. Check manufacturer instructions for correct type and size of wire-and-plug assembly.\n\nRange receptacle must be properly grounded. Following simple check confirms whether range is connected safely:\n\n1. Use voltmeter set to measure AC volts. Check voltage across line and neutral conductors at range receptacle. Meter should read 120V, ±10%.\n2. Next, check voltage across line and ground conductors. Meter should read 120V.\n3. Finally, check voltage across neutral and ground conductors. Meter should read 0V.\n\nReadings that differ from above indicate that circuit or receptacle wiring is incorrect or defective and must be corrected before range is installed.\n\nFUEL CONVERSION:\nConversion from one fuel to another may be required for number of reasons. For example:\n- Natural gas may become available in area previously serviced only by propane\n- Natural-gas appliance may be purchased for use in area where only propane is available\n\nThree common types of gas pressure regulators exist, each with different method for converting from one gas to another. Important to ensure that appliance regulator is adjusted to operate with gas being used.",
          "assignment_questions": []
        },
        {
          "chapter_number": 2,
          "chapter_name": "Dryers",
          "pages": "99-109",
          "topics": [
            "Clearance to combustibles (6 in/150mm if not specified)",
            "Flexible metal connectors (6 ft maximum)",
            "Moisture exhaust duct requirements",
            "Foil duct tape prohibited (use cloth mesh)",
            "No connection to other appliance vents",
            "Exhaust hood termination (12 in/300mm above ground)",
            "Maximum exhaust system length (elbows reduce length)",
            "Exhaust vent diameter (4 in/100mm minimum)",
            "Drum rotation (47-50 rpm optimum)",
            "Baffles for clothing tumbling",
            "Belt diameter, alignment, and condition",
            "Lint trap cleaning importance",
            "Drum seal defects (loss of negative pressure)",
            "Electrical sequence of operation",
            "Door switch, timer motor, drive motor",
            "Centrifugal switch",
            "Main coil valve circuit",
            "Burner ignition systems (Glo-sil, spark-ignition, constant-pilot)",
            "Glo-sil igniter (50-25Ω resistance, 10-30 sec heat-up)",
            "Radiant sensor (2200°F/1200°C)",
            "Glow-coil ignition (transformer, warp switch, warp switch heater)",
            "Warp switch operation (3.5-4 min glow time)",
            "Three-point test for switches and loads",
            "Troubleshooting motor problems",
            "Troubleshooting dryer operation",
            "Safety thermostat and cycling thermostat",
            "Blower assembly and lint trap blockage",
            "Drum seal replacement",
            "Overload protector in motors"
          ],
          "content": "Chapter 2 covers installation, operation, and servicing of gas-fired clothes dryers.\n\nCLEARANCE TO COMBUSTIBLES:\nIf there are no manufacturer rating plate clearances, allowable code clearances to combustibles from top, back, and sides of domestic gas dryer are 6 in (150mm).\n\nFLEXIBLE METAL CONNECTORS:\nMaximum length of metal connector used to connect gas dryer is 6 ft (2.0m). Same requirements apply as with ranges - connector must be protected from damage, not pass through walls/floors/ceilings, and shut-off valve must be in same room.\n\nMOISTURE EXHAUST DUCT REQUIREMENTS:\n- Use cloth mesh duct tape to connect dryer moisture-exhaust duct joints (NOT foil duct tape or electrical tape)\n- Three evenly spaced sheet metal screws can also be used\n- Moisture exhaust duct CANNOT be connected to another gas appliance vent connector to create common vent\n- Exhaust hood must terminate 12 in (300mm) above ground level\n- Minimum exhaust vent diameter is 4 in (100mm)\n\nMAXIMUM EXHAUST SYSTEM LENGTH:\nMaximum length of exhaust system is determined by:\n- Type of exhaust hood\n- Type of vent material\n- Number of elbows\n\nEach elbow reduces maximum allowable length.\n\nDRYER OPERATION:\n\nDRUM ROTATION:\nDrum rotates at between 47 and 50 rpm. Engineering studies have shown this is optimum range for drying contents of dryer.\n\nIF drum turns faster: Clothes are pressed against outside of drum and do not tumble\nIF drum turns slower: Clothes ball up in drum\n\nIn both cases, drying times are greatly increased.\n\nDrum speed on dryer is affected by:\n- Belt diameter\n- Belt alignment\n- Belt condition\n\nBe sure to check and replace belt if required.\n\nBAFFLES:\nBaffles inside dryer are positioned so that clothing is tossed around, increasing its exposure to heated air. Without baffles, clothing would not dry as quickly.\n\nLINT TRAP AND DRUM SEALS:\nFor system to work efficiently:\n\n1. FRONT AND REAR OF DRUM MUST BE PROPERLY SEALED:\nIf drum seal is defective, air can bypass heater box. This creates loss of negative pressure, reducing drying efficiency.\n\n2. LINT TRAP MUST BE KEPT CLEAN:\nIf lint trap is clogged, negative pressure in burner box is reduced, and heat from burner flows out hole and is sensed by safety thermostat. End result of blocked lint screen is that air is not able to move freely, and drying time increases.\n\nSERVICE:\n\nELECTRICAL SEQUENCE OF OPERATION:\nKnowing sequence of operation for electrical start-up of dryer makes it easier to determine possible faults.\n\nTypical sequence:\nAs soon as timer is turned on:\n1. All circuits close\n2. Circuit from timer to door switch is completed through door switch to timer motor and drive motor\n3. Timer motor circuit is completed\n4. Drive motor circuit is completed\n5. Centrifugal switch is closed\n6. Circuit from timer through thermostat to main coil valve is closed\n7. Neutral from main coil valve is completed through limit switch and centrifugal switch\n8. Burner is activated\n9. Circuit from timer to panel and drum lights is closed\n\nIf this basic sequence does not occur, there is problem with dryer.\n\nGENERAL ELECTRICAL TROUBLESHOOTING:\nTo locate general problem area:\n1. Turn on dryer\n2. Set temperature to high\n3. Check power at burner\n4. Test switches and loads\n\nCHECK POWER TO BURNER:\n- If there IS power to burner: Concentrate tests on burner\n- If there is NO power to burner: Check operating switches in dryer circuit\n\nTHREE-POINT TEST:\nUse three-point test to test switches and loads (requires good-quality multimeter):\n\nOPEN SWITCH:\n- Voltage reading across switch\n- Voltage reading on inlet terminal to ground\n- No voltage on outlet terminal to ground\n\nCLOSED SWITCH:\n- No voltage reading across switch\n- Voltage reading on inlet terminal to ground\n- Voltage reading on outlet terminal to ground\n\nON A LOAD:\n- Voltage reading across load\n- Voltage reading on hot terminal to ground\n- No voltage reading on neutral terminal to ground\n\nON A LOAD THAT HAS LOST NEUTRAL:\n- No voltage reading across load\n- Voltage reading on hot terminal to ground\n- Voltage reading to neutral terminal to ground\n\nTROUBLESHOOTING BURNER IGNITION:\n\nGLO-SIL AND SPARK-IGNITION SYSTEMS:\nWhen line voltage is applied to Glo-sil igniter, it should heat up to operating temperature in 10 to 30 sec. Resistance across terminals of good igniter should be between 50 and 25Ω in Glo-sil coils.\n\nCheck Glo-sil ignition:\n1. If there is power to burner, shut power off\n2. Disconnect leads to burner\n3. Use multimeter to check sensor switch and Glo-sil\n4. Check for cracks in Glo-sil\n5. If Glo-sil is fine, check radiant sensor for continuity\n\nCAUTION: Never apply line voltage directly to sensor.\n\nCan test igniter and motor of dryer using spark-ignition burner by applying direct power to igniter terminals.\n\nSMELL OF GAS (Glo-sil and spark-ignition):\nPossible causes and solutions:\n- Welded igniter points → Sand down or replace\n- Overfired burner → Check input\n- Broken fan → Replace fan\n- Bypassing valve → Replace valve\n- Sensor opening before reaching 2200°F (1200°C) → Replace sensor\n\nCONSTANT-PILOT BURNER:\nCommon faults:\n- PILOT EXTINGUISHES: Drafts coming in (check outside vent flapper), dirty pilot (remove and clean), mercury switch not holding plunger up (replace)\n- PILOT LIGHTS BUT NO HEAT: Door not staying closed (repair latch), blown fuse (replace and check cause), unplugged (plug in), plugged lint trap (clean), open limit switch (check blocked lint trap and exhaust vent), broken belt (replace), defective gas valve (replace), control set to \"air\" (set to \"high\")\n\nGLOW-COIL IGNITION:\nTransformer, warp switch, and warp switch heater are combined into one unit. If any one fails, all must be replaced as complete assembly.\n\nTo check unit:\n1. Apply 120V to burner with gas supply turned off\n2. Glow coil should glow for approximately 3.5 to 4 min and then go out as warp switch opens\n3. Turn dryer off; after 10 to 15 min, warp-switch heater cools sufficiently to allow warp switch to close\n\nCommon faults:\n- WARP SWITCH NOT OPENING: Defective warp switch heater (test with ohmmeter and replace unit)\n- GLOW COIL NOT GLOWING: Corroded terminals (clean), defective transformer (measure voltage), defective pilot switch (replace), defective glow coil (replace)\n- GLOW COIL GLOWING BUT NOT IGNITING GAS: Screen plugged with lint (clean), glow coil warped (reposition), defective glow coil (replace)\n- NO PILOT FLAME: Pilot coil not energized (test pilot switch), defective pilot switch (replace)\n\nTROUBLESHOOTING DRYER OPERATION:\n\nMOTOR PROBLEMS:\n- Motor runs but drum doesn't turn: Broken/loose belt, loose pulley, frozen drum shaft\n- Motor hums but drum doesn't turn: Centrifugal switch contacts defective, switch mechanism stuck, motor start winding open, motor seized, drive components seized\n- Motor doesn't stop: Incorrect wiring, grounded motor/wiring, faulty timer\n- Motor doesn't start: Fuse blown, timer inoperative, motor inoperative, improper connection, door switch issue, door not closed properly\n- Motor runs intermittently: Motor covered with lint, motor bearings tightening, dryer bearings tightening\n- Motor runs louder than normal with burning odor: Centrifugal switch contacts failing to open, switch mechanism stuck\n\nDRYER AND DRUM PROBLEMS:\n- DRYER SMOKES: Lint accumulation (remove lint), burning wire insulation (check/correct short), overheated motor (check for lint buildup)\n- CLOTHES DRYING TOO SLOWLY: Blocked lint trap/vent pipe (clean), defective drum seal (replace), excessively long vent pipe (shorten), temperature control thermostat set too low (check), defective heat selector switch (check), failed drum seal (replace), tripping safety thermostat (replace if trips on normal operation), fluctuating/insufficient house voltage (call power company)\n- CLOTHES NOT DRYING ON AUTO-DRY: Timer advancing too soon (set for more time), control thermostat open to heat source (check thermostat)\n- DRYER DOES NOT DRY PROPERLY: Dryer overloaded (instruct user), blower assembly plugged (remove lint), lint trap blocked (remove lint), door not sealing tightly (adjust or replace seal), thermostats malfunctioning (check), selector switch defective (check)\n- DRUM TURNS BUT HEATER NOT ENERGIZED: Timer inoperative, selector switch faulty, terminal loose, thermostat inoperative, motor switch inoperative, wire broken in harness\n- DRUM OPERATES NOISILY: Drum warped (replace), lower drum guide sticking (reposition/replace), idler pulley noisy (replace), belt squeaking (use bar soap on belt or replace), foreign objects in drum (remove), belt frayed (replace), drum support bearings worn (lubricate/replace), motor pulley loose (tighten), front/rear drum seals worn (replace), machine not level (level machine)\n\nBURNER PROBLEMS:\n- MAIN BURNER DOES NOT LIGHT: Safety thermostat wiring loose (check wiring or replace), temperature control thermostat inoperative (replace), motor centrifugal switch contacts defective (clean)\n- MAIN BURNER DOES NOT OPERATE PROPERLY: Motor wiring loose or timer not working (check), defective door switch (replace), faulty temperature control thermostat (replace)\n\nIMPORTANT: Motors on dryers have overload protector, which is similar to fuse. It protects motor from burning out if there is mechanical or electrical overload. When checking motor, check that overload protector has not failed. If protector has failed, motor needs to be replaced.",
          "assignment_questions": [
            {
              "question": "If there are no manufacturer rating plate clearances, what are the allowable code clearances to combustibles from the top, back, and sides of a domestic gas dryer?",
              "options": [
                "a) 2 in (50 mm)",
                "b) 6 in (150 mm)",
                "c) 18 in (450 mm)",
                "d) 24 in (600 mm)"
              ],
              "correct_answer": "b) 6 in (150 mm)"
            },
            {
              "question": "What is the maximum length of a metal connector used to connect a gas dryer?",
              "options": [
                "a) 2 ft (0.6 m)",
                "b) 3 ft (1.0 m)",
                "c) 6 ft (2.0 m)",
                "d) 10 ft (3.0 m)"
              ],
              "correct_answer": "c) 6 ft (2.0 m)"
            },
            {
              "question": "What should be used to connect dryer moisture-exhaust duct joints?",
              "options": [
                "a) Foil duct tape",
                "b) Electrical tape",
                "c) Cloth mesh duct tape",
                "d) Three evenly spaced sheet metal screws"
              ],
              "correct_answer": "c) Cloth mesh duct tape"
            },
            {
              "question": "Indicate whether the given statement is true or false. The moisture exhaust duct can be connected to another gas appliance vent connector to create a common vent.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "b) False"
            },
            {
              "question": "How far above ground level should the exhaust hood terminate?",
              "options": [
                "a) 8 in (200 mm)",
                "b) 12 in (300 mm)",
                "c) 20 in (500 mm)",
                "d) 40 in (1000 mm)"
              ],
              "correct_answer": "b) 12 in (300 mm)"
            },
            {
              "question": "What determines the maximum length of the exhaust system?",
              "options": [
                "a) Type of exhaust hood",
                "b) Type of vent material",
                "c) Number of elbows",
                "d) All of the above"
              ],
              "correct_answer": "d) All of the above"
            },
            {
              "question": "What causes a gas dryer to keep running after its door is opened?",
              "options": [
                "a) Faulty door switch",
                "b) Faulty booster coil",
                "c) Faulty holding coil",
                "d) Defective centrifugal switch"
              ],
              "correct_answer": "a) Faulty door switch"
            },
            {
              "question": "What problem does a defective drum seal cause?",
              "options": [
                "a) Dryer smoking",
                "b) Clothes drying too slowly",
                "c) Drum operating noisily",
                "d) Main burner not lighting"
              ],
              "correct_answer": "b) Clothes drying too slowly"
            },
            {
              "question": "What is the minimum exhaust vent diameter for a gas dryer?",
              "options": [
                "a) 3 in (75 mm)",
                "b) 4 in (100 mm)",
                "c) 5 in (125 mm)",
                "d) 6 in (150 mm)"
              ],
              "correct_answer": "b) 4 in (100 mm)"
            },
            {
              "question": "What problem is caused by the dryer not being level?",
              "options": [
                "a) Dryer smokes",
                "b) Clothes drying too slowly",
                "c) Drum operating noisily",
                "d) Main burner not lighting"
              ],
              "correct_answer": "c) Drum operating noisily"
            }
          ]
        },
        {
          "chapter_number": 3,
          "chapter_name": "Barbecues",
          "pages": "116-126",
          "topics": [
            "Barbecue burners (single, dual, side burners)",
            "Infrared burner technology",
            "Ceramic tile with microscopic holes",
            "Infrared grill benefits (less fuel, faster cooking, better taste)",
            "Infrared burner heats to 1000°F (540°C) in 3 min",
            "Briquettes and lava rocks (radiant heat)",
            "Crossover or piezo ignition system",
            "Match-light hole",
            "Barbecue components",
            "Lid, warming rack, cooking grates, flavorizer bars",
            "Control panel, burner control knobs, igniter button",
            "Manifold assembly, venturi tube",
            "Spider stopper guards",
            "Ignition sequence (piezo vs manual)",
            "Safety when igniting (always open lid, wait for gas to clear)",
            "Combustion process (venturi, primary air, air shutters)",
            "Flame characteristics (light blue, dark blue, tips occasionally yellowish)",
            "Adjusting primary air shutters",
            "Spider guards (prevent insects from nesting)",
            "Troubleshooting gas barbecues",
            "Smell of gas (leak detection and repair)",
            "Quick-disconnect coupling seating",
            "Flame flashback (venturi tube blocked)",
            "Spark ignition failure (ground connections)",
            "Burner not lighting (gas shut-off, hose bent/kinked)",
            "Igniter electrode alignment",
            "Orifice cleaning",
            "Premature burner burn-out (excessive lava rocks)",
            "Hot spots (uneven briquette distribution)",
            "Flare-ups or grease fires (excessive grease buildup)",
            "Yellow or orange flame (blocked venturi or spider guard)",
            "Cleaning venturi and burner tube with pipe cleaner"
          ],
          "content": "Chapter 3 covers installation, operation, and servicing of gas-fired barbecues.\n\nBURNERS:\nSome barbecues have only one burner, while others have two burners placed side by side. Some barbecues also come with side burners.\n\nINFRARED BURNER TECHNOLOGY:\nMany barbecues today incorporate infrared burner technology used as rotisserie burners and, in some cases, as main burner. Infrared burner works by focusing flame of standard gas burner onto ceramic tile that has thousands of microscopic holes in it. This converts heat of flame into infrared energy, same energy you feel from sun on cold day. This heat is much higher and more intense than standard grill can produce.\n\nMAIN BENEFITS OF INFRARED GRILL:\n- Less fuel use\n- Faster cooking time\n- Better taste\n- Simpler cleaning\n\nInfrared burner heats to over 1000°F (540°C) in approximately 3 min. In amount of time traditional barbecue reaches normal cooking temperatures with all three burners turned to \"high\", single infrared gas grill burner can have cooked several steaks and be cleaned and cool enough to cover.\n\nBRIQUETTES AND LAVA ROCK:\nMany barbecues use ceramic briquettes or lava rocks. Gas flame heats surface of briquettes or lava rocks that, in turn, radiate heat to cook food. Take care not to have too many lava rocks or briquettes since heat being trapped between burner and rocks may cause premature burner burn-out and increase cooking times.\n\nTHE IGNITION SYSTEM:\nBarbecues use crossover or piezo ignition system. When piezo button is pushed, it energizes igniter electrode inside gas-catcher ignition chamber. This creates spark that ignites gas. Barbecues can also be manually lit through match-light hole in front of cooking box.\n\nCAUTION: Always have barbecue lid open before attempting ignition.\n\nBARBECUE COMPONENTS:\nTypical barbecue includes:\n- Lid and lid handle\n- Warm-up basket and warming rack\n- Flavorizer bars (short and long)\n- Cooking grates\n- Work table and swing table assembly\n- Frame connectors and wheel frame\n- Wheels, casters, and wheel hubcaps\n- Front panel and control panel\n- Burner control knobs\n- Igniter button and igniter assembly\n- Gas catcher ignition chamber\n- Manifold assembly and manifold bracket\n- Burners (front, back, centre)\n- Venturi tubes\n- Spider stopper guards\n- Crossover tube\n- Catch pan and drip pans\n- Thermometer\n- Hose and tubing\n\nOPERATION:\n\nEach season, before barbecue is used, visual inspection must be made to ensure that all piping and tubing are sound and that there are no visible faults. Failure to do this could result in injury or death.\n\nIGNITION SEQUENCE:\n\nPIEZO IGNITION:\nTo light barbecue using piezo igniter system:\n1. Ensure all burner control knobs are off\n2. Open lid\n3. Turn gas supply valve on\n4. Turn burner control that is closest to igniter to \"start\" or \"high\"\n5. Push piezo button several times so it clicks each time (each click creates spark)\n6. Check through match-light hole in front of cooking box to see if front burner is lit\n7. If burner is lit, turn on other burners (they light from flame of first burner)\n\nMANUAL IGNITION:\nTo manually light barbecue:\n1. Close all burner control valves\n2. Open lid\n3. Turn gas supply valve on\n4. Light match and put it through match-light hole in front of cooking box\n5. Turn front burner control knob to \"start\" or \"high\"\n6. Check that burner is lit by looking through match-light hole\n7. Once first burner is lit, turn on other burners\n\nTO EXTINGUISH (both ignition systems):\n- First, turn gas supply valve off\n- Then turn each burner control knob off\n\nSAFETY WHEN IGNITING:\n- Always open lid before lighting barbecue\n- If burner does not ignite, wait few minutes for gas to clear before trying again (gas may collect and explode)\n- Never lean over barbecue or look through match-light hole when lighting barbecue\n\nTHE COMBUSTION PROCESS:\nWhen burner control valve is open, gas flows into burner tube through venturi:\n- Movement of gas through venturi reduces pressure in burner tube\n- As result, primary air is sucked into tube through air shutters\n- Primary air mixes with gas in burner tube and is ignited at burner head\n- When air-gas mixture ignites, it draws in secondary air from around burner to complete combustion process\n\nFLAME CHARACTERISTICS:\nGood burner flame for barbecue:\n- Light blue (outer)\n- Dark blue (inner)\n- Tips occasionally yellowish\n\nADJUSTING PRIMARY AIR:\nEach burner on barbecue has air shutter that can be adjusted to allow more or less primary air into burner tube. For some models of burners, spider guard needs to be removed before they can be adjusted, while other types have shutters that move with screen in place.\n\nSPIDER GUARDS:\nSpider guards prevent spiders and other insects from nesting in burner tubes. Without guard and with nests in burner tubes, gas may flow out of air shutter, causing fire around shutter. If burners do not have spider guards, aftermarket types are available that can be added over venture tube air shutters.\n\nOne sign that indicates spider guard may need cleaning is cooking flame that appears to be yellow and lazy.\n\nSERVICE:\n\nTROUBLESHOOTING GAS BARBECUES:\n\nSMELL OF GAS:\nPossible leak → Shut off gas immediately, check for leaks, repair leak\n\nLEAK DETECTED AT CONNECTION:\n- Quick-disconnect coupling not seated fully → Remove coupling, check that coupling is clean, reconnect coupling\n- Gas leak in connection → Tighten connection, perform leak test\n- Gas leak in hose or control valves → Replace hose or control valves\n\nFLAME FLASHBACK BENEATH CONTROL PANEL:\nVenturi tube blocked → Remove burner and clean venturi tube. Use pipe cleaner or venturi brush to clean venturi.\n\nSPARK IGNITION FAILURE:\nPoor ground connections → Check and fix ground connections\n\nBURNER NOT LIGHTING:\n- Gas shut-off valve closed → Open gas shut-off valve\n- Fuel hose bent or kinked → Straighten fuel hose\n- Igniter wire(s) not connected → Connect burner electrode wires\n- Igniter electrode misaligned on burner → Realign electrode\n- Igniter malfunction → Manually light burner\n- Venturi blocked → Remove burner and clean venturi\n- Venturi not aligned with valve orifice → Realign venturi to orifice\n- Orifice blocked → Remove burner, clean orifice with pin or fine wire\n\nPREMATURE BURNER BURN-OUT:\nExcessive lava rocks → Reduce number of lava rocks\n\nHOT SPOTS ON COOKING SURFACE:\n- Uneven briquette distribution → Spread briquettes evenly on grate\n- Venturi blocked → Remove burner and clean venturi\n\nFLARE-UPS OR GREASE FIRES:\n- Excessive grease buildup on briquettes → Clean briquettes (remove cooking grid, turn briquettes over, light burner, allow self-clean, finish by placing briquettes in one layer)\n- Dirty cooking surfaces or bottom tray → Clean thoroughly\n- Excessive heat → Turn burner controls to lower setting or raise cooking grid\n\nYELLOW OR ORANGE FLAME:\n- Excessive yellow flame possibly caused by blocked venturi → Remove burner and clean venturi\n- Spider stopper guard blocked → Clean spider stopper guard\n- Burner ports blocked → Remove burner and clean with soft-bristle brush or scraper\n\nFLAME LOW IN \"HIGH\" POSITION:\nFuel hose bent or kinked → Straighten fuel hose\n\nINSIDE OF LID SEEMINGLY PEELING:\nGrease buildup, not faulty paint → Clean with stiff-bristle brush or scraper\n\nCLEANING VENTURI AND BURNER TUBE:\nClean venturi tubes using pipe cleaner or venturi brush to eliminate any blockages caused by spiders or insects.\n\nIMPORTANT: When installing parts on barbecue, always refer to manufacturer instructions.",
          "assignment_questions": [
            {
              "question": "Indicate whether the given statement is true or false. Most barbecues can be used on propane or natural gas without any modifications.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "b) False"
            },
            {
              "question": "Indicate whether the given statement is true or false. A shut-off valve is not necessary when using a quick-disconnect device.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "b) False"
            },
            {
              "question": "Indicate whether the given statement is true or false. Barbecues equipped with a piezo ignition can be match-lit.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "a) True"
            },
            {
              "question": "Indicate whether the given statement is true or false. Aftermarket spider guards can be installed onto burner tubes.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "a) True"
            },
            {
              "question": "Indicate whether the given statement is true or false. During the lighting of a barbecue, the lid must be closed.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "b) False"
            },
            {
              "question": "What is the maximum length of a barbecue connecting hose?",
              "options": [
                "a) 2 ft (0.6 m)",
                "b) 6 ft (2 m)",
                "c) 10 ft (3 m)",
                "d) 15 ft (4.6 m)"
              ],
              "correct_answer": "b) 6 ft (2 m)"
            }
          ]
        },
        {
          "chapter_number": 4,
          "chapter_name": "Lamps",
          "pages": "128-138",
          "topics": [
            "Gas lighting (outdoor and indoor)",
            "Historical districts use",
            "Rating plate and specifications",
            "Type of gas, Btu rating, model number, serial number",
            "Clearances (18 in above, 5 in all sides for bracket/pendant)",
            "No appliance regulator (operates at system pressure, 7 in w.c. natural gas)",
            "Fuel conversion notation on rating plate",
            "Clearance reduction with protection",
            "Piping and tubing (code requirements)",
            "Wall bracket fixture support (CSA B149.1, Clause 7.31.2)",
            "Swing type with stop to prevent globe contact",
            "Components of gas lamps",
            "Valve assembly (protective screen, lamp valve, override button)",
            "DC powered valve, valve stem, set screw",
            "Venturi assembly with electrode",
            "High voltage white wire to spark electrode",
            "Green to ground, blue/red to DC powered gas valve",
            "Construction materials (iron, aluminum, brass, copper, bronze)",
            "Burner (copper or ceramic)",
            "Tempered glass globe",
            "Mantles (soft autoform mantles vs preformed hard mantles)",
            "Installing soft mantle (tie-on strings, burner nose groove)",
            "Burning off protective coating",
            "Installing preformed hard mantle",
            "Gas lamp covers (decorative and protective)",
            "Indoor gas lamps (practical and decorative, require proper venting)",
            "Outdoor gas lamps (decorative, all-weather)",
            "Primary airflow (venturi, air ports)",
            "Gas lamps with mantle (bright white flame)",
            "Adjusting primary airflow (air-shutter rings)",
            "Ignition methods (electrode with switch/photosensor, manual with match)",
            "Automatic systems with solar cell",
            "Photosensor detection",
            "Service and troubleshooting",
            "Venturi and screens cleaning",
            "Solar cell cleaning",
            "Glass casings cleaning",
            "Annual cleaning and painting",
            "Leak testing with soap solution",
            "Flame impingement (burned metal)",
            "Electrode ignition system troubleshooting",
            "Battery voltage and solar panel charging",
            "Photosensor alignment",
            "Electrode alignment with burner head",
            "Gas pressure adjustment"
          ],
          "content": "Chapter 4 covers installation, operation, and servicing of gas-fired lamps.\n\nINSTALLATION REQUIREMENTS:\n\nRefer to Clause 7 of CSA B149.1 when installing gas lighting or lighting fixtures. All gas lamps must be installed according to manufacturer instructions, and installation must comply with Code. Once lamp has been installed, operating instructions must be left with user.\n\nRATING PLATE AND SPECIFICATIONS:\nAll gas appliances must be fitted with rating plate that provides:\n- Type of gas\n- Btu rating\n- Model number\n- Serial number\n- Clearances\n\nMost gas lamps do not have appliance regulator and, therefore, operate at pressure supplied by piping system (usually 7 in w.c. for natural gas). In these cases, burner manifold pressure may not be noted on rating plate.\n\nIMPORTANT: If gas lamp has been converted, this must be noted on rating plate.\n\nGas lamps vary considerably in design, and it is difficult to find standardized specifications. Manufacturers' specifications are, therefore, important to read during installations.\n\nCLEARANCES:\nClearances for gas appliances are stated on rating plate of gaslight. CSA B149.1, Clause 7.31.3, also contains specific requirements for different types of lighting:\n\n\"Except where permitted by Clause 4.13.2, bracket or pendant fixture shall have following minimum clearances from combustible material:\na) Above — 18 in (450mm); and\nb) All sides — 5 in (125mm).\"\n\nMain objective of clearances for gas lamps is to prevent globe from contacting combustible materials. Note that ignition temperatures vary for different materials. For example, paper on wallboard ignites at lower temperature than wood or plastic.\n\nTherefore, locate lamp, taking into consideration temperature tolerance of surrounding materials.\n\nCode allows reduction of clearance if:\n- It is approved as being safe to do so by approved authority, and reduced clearance level is marked on rating plate; or\n- Combustible material is protected, and reduced clearance is in accordance with Code\n\nPIPING AND TUBING:\nAll piping and tubing used with gas lamps must meet code requirements. Gas lamp must be confirmed to be properly mounted and supported to avoid putting any pressure on piping supplying lamp.\n\nClause 7.31.2 of CSA B149.1 states: \"A wall bracket fixture shall be firmly supported, and if of swing type, it shall be provided with stop to prevent contact of globe with combustible material.\"\n\nCOMPONENTS:\n\nThere are many different types of gas lamps, and components often vary from one lamp to next. Manufacturer assembly instructions normally list components of lamp.\n\nVALVE ASSEMBLY:\nTypical gas lamp valve assembly includes:\n- Protective screen\n- 1/4 in lamp valve in OFF position\n- Valve assembly\n- DC powered valve\n- Threaded cap\n- Brass hex nut\n- Override button\n- Slot above door opening (access slot)\n- Valve stem\n- Set screw\n\nVENTURI ASSEMBLY:\nVenturi assembly with electrode includes:\n- Venturi assembly\n- High voltage white wire to spark electrode's high voltage coil\n- Green to ground\n- Blue/red to DC powered gas valve\n- Spark electrode\n\nCONSTRUCTION MATERIALS:\nMost gas lamps use same construction materials:\n\nFRAME:\nUsually made of iron, aluminum, brass, copper, or bronze. Brass and copper are commonly used for gas lamps due to their rust resistance.\n\nBURNER:\nMade of either copper or ceramic. Often enclosed by tempered glass globe to withstand temperature changes.\n\nMANTLES:\nLamps are equipped with mantles, device for generating bright white light when heated by flame.\n\nThere are two basic types of mantles:\n- Soft mantles (soft autoform mantles)\n- Preformed hard mantles\n\nINSTALLING THE MANTLE:\n\nSOFT MANTLE:\nProcedure for installing soft mantle:\n1. Ensure lamp valve is closed and light has been off long enough to cool down\n2. Remove old mantle\n3. Loop tie-on strings at throat of mantle\n4. Use fingers to enlarge throat so it fits over burner\n5. Fit mantle over burner so that it seats in lower groove of burner nose\n6. Shape mantle evenly\n7. Pull ends of tie-on strings so that mantle and strings are seated securely in burner nose groove\n8. Tie double knot in string and cut off ends\n9. Hold lit match close to, but not touching, mantle. Mantle should smoulder as its protective coating burns off. Once done, mantle becomes form of chemical ash and must be handled carefully. It may break if touched.\n10. Let mantle cool for few minutes after coating has burned off\n11. Now, turn gas on and light mantle without touching it with match. On new installation, it may take while for mantle to burn because of air in gas line.\n12. Turn gas on fully to allow mantle to burn to its proper shape. After about 5 min, adjust gas control for desired amount of light.\n\nWhen gas light is burning properly, flame is bright white and has no visible outlines.\n\nPREFORMED HARD MANTLE:\nInstalled as follows:\n1. Ensure gas supply is turned off and light has been off long enough to cool\n2. Remove old mantle\n3. Take mantle out of its box and place throat over burner nose\n4. Follow Steps 6 to 12 from procedure for soft mantles\n\nGAS LAMP COVERS:\nGas lamp covers come in different forms. They serve decorative purpose as well as protecting flame from weather and other external effects. They also safely enclose burning flame.\n\nCover, including glass, should be able to resist sudden temperature changes that occur when lamp is switched on or off.\n\nOPERATION:\n\nSince there are many different types of gas lamps, it is important to read manufacturer instructions for specific lamps. These instructions must be left with user after lamp has been installed.\n\nTYPES OF LAMPS:\n\nINDOOR GAS LAMPS:\nIndoor gas lamps serve both practical and decorative purposes. Make sure these lamps are used only in properly vented rooms. Carbon monoxide is formed if there is incomplete combustion. If room is not properly vented, there may be buildup of dangerous gases.\n\nArea around lamp must also be kept free of combustible materials, including flammable vapours and liquids, such as gasoline.\n\nEven though gas flame is small, it still requires primary air for combustion. Gas flows through venturi to burner. Movement of gas through venturi sucks in air through air ports.\n- There should be no obstruction to flow of primary air\n- If burner is dirty or has insects nesting in it, airflow is obstructed\n- Burner must be kept clean\n\nOUTDOOR GAS LAMPS:\nOutdoor gas lamps are used mainly for decorative purposes. They can usually operate in all types of weather and are useful in event of power outage.\n- With these lamps, there must be no obstruction to primary airflow\n- Lamp must be properly vented\n- There should be no combustible materials near lamp\n\nPRINCIPLES OF GAS LAMP OPERATION:\n\nSelection of lamp with or without mantle depends on intended use of lamp. Gas lamps without mantles give \"flicker flame\" and are intended purely for decorative purposes. For functional lighting purposes, lamp equipped with mantle is required.\n\nGAS LAMPS WITH MANTLE:\nIn mantle-equipped gas lamp, mantle burns white hot and gives off light.\n\nFLAME CHARACTERISTICS:\n- BRIGHT WHITE WITH NO VISIBLE OUTLINES: Flame is burning properly\n- NOT BRIGHT WHITE OR HAS VISIBLE OUTLINES: Airflow to gas may need adjustment\n- YELLOW FLAME: Airflow should be increased\n- POOR FLAME QUALITY: Cause may be broken mantle, in which case mantle must be replaced\n\nADJUSTING PRIMARY AIRFLOW:\nPrimary airflow is controlled by adjusting air-shutter rings near burner (check manufacturer instructions to determine exact location).\n- Adjust air-shutter rings until optimal light is obtained\n- Gas pressure may also need adjustment (check manufacturer instructions for correct pressure setting)\n\nIGNITION:\nThere are two ways in which gas lamps are ignited:\n1. By electrode that is operated manually with switch or automatically with photosensor; or\n2. Manually using open flame, such as match\n\nIN AUTOMATIC SYSTEMS:\nSolar cell detects light falling below certain point and opens electronic circuit to electrode. It also opens gas valve.\n- Electrode sparks until gas lamp is lit\n- Photosensor detects when lamp is lit and stops electrode from sparking\n- When light in area reaches certain level (such as at sunrise), solar cell closes gas valve and extinguishes lamp\n\nSERVICE:\n\nBecause there are so many different types of gas lamps available, it is important to consult manufacturer instructions before installing or replacing any components.\n\nImportant that manufacturer procedures are followed. Otherwise, lamp may not work properly.\n\nSERVICING AND TROUBLESHOOTING:\nBefore starting any repairs:\n1. Turn off gas supply\n2. Wait for lamp to cool\n3. Remove and clean glass\n4. Replace mantle if it is broken\n\nGENERAL MAINTENANCE:\n- Ensuring that venturi and all screens are clean and clear of insects\n- Making sure solar cell is clean (if so equipped)\n- Cleaning glass casings\n\nAt least once year, outdoor gas lamp should be properly cleaned and painted if necessary.\n\nLEAK TESTING:\nIf there is smell of gas or if new gas lamp or new fittings have been installed to gas supply line, perform leak test with soap solution or leak detector.\n- Check all joints and connections\n- Tighten any connections that may be loose\n\nCAUTION: Never use open flame to test for leaks.\n\nFLAME IMPINGEMENT:\nBurned metal on gas lamp indicates one of two situations:\n- Flame that is too hot; or\n- Flame impingement\n\nFlame impingement means that flame is in contact with surface, causing flame to cool. When flame cools, it cannot burn all of gas so carbon or CO is produced.\n\nTo correct this problem, adjust:\n- Air openings\n- Gas pressure\n- Or both\n\nTROUBLESHOOTING ELECTRODE IGNITION SYSTEMS:\n\nELECTRODE DOES NOT BEGIN SPARKING WHEN IT GETS DARK:\n- Check battery connection\n- Check that battery voltage matches manufacturer specifications\n- Check solar cell connection and polarization\n- Check electrode wire and ground wire connections\n\nELECTRODE DOES NOT STOP SPARKING AFTER IGNITION:\n- Check alignment of mantle over photosensor\n- Check that photosensor is clean\n- Check alignment of photosensor\n- Check gas pressure\n\nLAMP KEEPS BURNING AFTER IT GETS LIGHT:\n- Check solar cell connection and polarization\n- Check polarization of valve connection to circuit board\n\nVALVE DOES NOT OPEN OR ALLOW OPERATION:\n- Check polarization of valve connection to circuit board\n- Check that battery voltage matches manufacturer specifications\n\nVALVE OPENS, ELECTRODE SPARKS, BUT MANTLES DO NOT IGNITE:\n- Check that gas supply line is properly bled of air\n- Check that electrode is aligned with burner head\n- Check alignment of mantle\n\nAT NIGHT, LAMP IGNITES BUT THEN TURNS OFF:\n- Check alignment of mantle over photosensor\n- Check that photosensor is clean\n- Check alignment of photosensor\n- Check gas pressure\n\nBATTERY VOLTAGE IS LOWER THAN MANUFACTURER SPECIFICATIONS:\n- Check that solar panel is facing sun and allow battery to charge",
          "assignment_questions": [
            {
              "question": "Indicate whether the given statement is true or false. Soft mantles are more durable than hard mantles due to their flexibility.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "b) False"
            },
            {
              "question": "Indicate whether the given statement is true or false. The purpose of the venturi assembly is to generate bright white light when heated by the flame.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "b) False"
            },
            {
              "question": "Indicate whether the given statement is true or false. Indoor gas lamps should only be used in well-ventilated rooms.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "a) True"
            },
            {
              "question": "Indicate whether the given statement is true or false. Before starting any repairs, you should turn off the gas supply and allow the glass to cool.",
              "options": [
                "a) True",
                "b) False"
              ],
              "correct_answer": "a) True"
            },
            {
              "question": "How often should a gas lamp be cleaned?",
              "options": [
                "a) Weekly",
                "b) Monthly",
                "c) Annually",
                "d) Biannually"
              ],
              "correct_answer": "c) Annually"
            }
          ]
        }
      ]
    },
    "7th": {
      "unit_name": "Unit 15 - Domestic Appliances",
      "category": "G2",
      "documents": [
        {
          "filename": "CSA Unit 15 - Domestic Appliances - Final.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances",
          "char_count": 198808,
          "content": "CSA Unit 15 - Domestic \nAppliances \nChapter 1                                       Gas \nRanges: Installation and \nServicing\nCooking with gas has always been the choice of professional chefs and has \ngained a similar reputation in the home. The instant heat and immediate cool-\ndown are features that electric units find difficult to compete with. Numerous \nstyles of gas ranges, types of ignition systems, and temperature controls are \nused in today's product lineup. The gas technician/fitter must be aware of old \nas well as new technology that may be encountered when installing and \nservicing gas ranges.\nMK by Mike Kapin\nCreated\nCopywrite 2025\nObjectives\nDescribe Different Types of Gas Ranges\nUnderstand the various types of gas ranges available \nin the market\nDescribe Installation Procedures\nLearn proper piping and electrical connections for gas \nranges\nDescribe Burners and Ignition Systems\nUnderstand the different burner types and ignition \nmechanisms\nDescribe Oven Controls\nLearn about calibration and testing of oven controls\nDescribe Operation of Gas Ranges\nUnderstand how gas ranges function\nDescribe Servicing of Gas Ranges\nLearn proper maintenance and repair procedures\nKey Terminology\nTerm\nAbbreviation (Symbol)\nDefinition\nAnti-tipping device\nDevice that prevents \naccidental tipping of a \nrange\nAppliance regulator\nUsed to reduce the gas \nsupply pressure to the \noperating pressure of \nthe appliance\nDrill Manufacturer's \nStandard\nDMS\nOrifice\nA hole or opening used \nprimarily to control the \ndirection and volume of \ngas flow into a burner\nCSA Gas Trade Unit Red Seal\nOccupational Skills\n•\nPerforms safety-related \nfunctions\n•\nMaintains and uses tools and \nequipment\n•\nPlans and prepares for \ninstallation, service and \nmaintenance\nGas Piping Preparation and \nAssembly\n•\nFits tube and tubing for gas \npiping systems\n•\nFits plastic pipe for gas piping \nsystems\n•\nFits steel pipe for gas piping \nsystems\nVenting and Air Supply Systems\n•\nInstalls venting\n•\nInstalls air supply system\n•\nInstalls draft control systems\nRed Seal Tasks (Continued)\nElectrical Systems Controls\n•\nSelects and installs electronic components\n•\nSelects and installs electrical components\n•\nInstalls automation and instrumentation control systems\nInstallation of Systems and Equipment\n•\nInstalls gas-fired system piping and equipment\n•\nInstalls gas-fired system components\n•\nInstalls propane storage and handling systems\nTesting and Commissioning\n•\nTests gas-fired systems\n•\nCommissions gas-fired systems\nServicing Gas-fired Systems\n•\nMaintains gas-fired systems\n•\nRepairs gas-fired systems\n•\nDecommissions gas-fired systems\nTypes of Gas Ranges\nFree-standing Ranges\nNot built-in or permanently installed. Most residential service gas-fired \nranges are 24 to 30 inches wide, free-standing units with an integral oven.\nBuilt-in Ranges\nPermanently installed as part of the kitchen cabinetry. A gas-fired wall oven \nis a separate built-in unit installed and operated independently from the \ndrop-in countertop cooktop unit.\nGas and Electric Combination Units\nOffer gas stove top burners with electric oven options.\nDual Fuel Units\nCan run on propane or natural gas. The conversion is usually accomplished by \nmeans of an adjustable orifice.\nMajor Features of Gas Ranges\nSelf-cleaning Feature\nAn oven equipped with a self-cleaning feature incinerates the \nbaked-on dirt in the oven by heating it to high temperature during a \ncleaning cycle.\nFor safety, the oven door locks when the cleaning cycle is selected \nand remains locked until the oven cools after the cleaning cycle ends.\nContinuous Cleaning Feature\nIn a continuous cleaning oven, the dirt is baked off the oven surfaces \non a continuous basis while food is cooking.\nBroiler\nGas stoves formerly utilized the oven burner to broil food: the lower \ndrawer was opened to allow the same oven burner to serve as a \nbroiler burner.\nNow, gas-fired ovens come with separate broiler units. The broiler is \na special burner located in the top of the oven. Heat from the burner \nis directed downward towards the food for broiling.\nWarming Drawer\nSome gas-fired ovens also have warming drawers, which maintain \ncooked food at the desired serving temperature.\nHeat Transfer Methods\nConvection\nTransfer of heat by heat currents\n•\nNatural convection: warm air rises, \ncool air descends\n•\nForced convection: fan circulates \nheat evenly\nConduction\nTransfer of heat through direct contact\n•\nExample: pot on range top burner \nheated through direct contact with \nflame\nRadiation\nTransfer of heat by means of heat rays\n•\nExample: overhead broiler burner\nConvection Methods\nNatural Convection Oven\nWarm air rises and cool air descends in the process of \nnatural convection. In a standard, natural convection oven, \nthe hottest area is at the top of the oven and the coolest is at \nthe bottom no matter where the burner is located.\nThermostats located in the oven can control the burner on-\noff cycle within a certain temperature range, but the \ntemperature may vary as much as 50°F from one area of the \noven to another. This makes it difficult to cook food evenly.\nForced Convection Oven\nIn a forced convection oven, a fan circulates the heat from \nthe burner evenly throughout the oven.\nThe circulating heat cooks food faster and more evenly than \na natural convection oven.\nInstallation Requirements\nManufacturer's \nSpecifications\nFound on the model and \nserial number identification \nplate (rating plate) \nattached to the appliance at \nthe factory.\nApplicable Codes\nAll range installations must \nconform to the \nrequirements of applicable \nbuilding, gas and electrical \ncodes.\nInstallation Instructions\nDetailed instructions provided by the manufacturer for proper \ninstallation.\nBefore installing a gas-fired range, review this information to ensure the \ninstallation will conform to the necessary requirements.\nManufacturer's Specifications\nBtu/h (kW) Rating\nInput rating of the \nappliance in Btu/h (or \nkW) is stamped on the \nrating plate.\nApprovals\nApprovals by regulating \nauthorities and \nagencies.\nOperating Voltage \nand Current\nElectrical requirements \nfor the range.\nOperating Pressure\nRequired gas pressure \nfor proper operation.\nInput Rating and Approvals\nInput Rating\nThe input rating of the appliance in Btu/h (or kW) is \nstamped on the rating plate. The rating plate specifications \nallow the appliance installer to determine the correct pipe or \ntubing size for the service and to set the burner inputs \ncorrectly.\nApprovals\nGas industry and governmental regulatory agencies must \napprove all gas appliances before the manufacturer can sell \nthem. Regulatory authorities recognize the service of third-\nparty certification organizations and provide the approval by \ninsisting that gas appliances receive certification from a \nrecognized certification organization.\nThe official logo, symbol, or seal that indicates the \ncertification of the appliance appears on the appliance's \nrating plate. The certification symbols that must appear on \nthe rating plate of a gas appliance sold in Canada include \nthose of CSA Group. Local provinces may recognize other \nagencies.\nOperating Voltage and Pressure\nOperating Voltage and Current\nThe range must only be connected to an electrical circuit \nthat conforms to the operating voltage and current rating \nspecified on the identification plate. Although older gas \nstoves with few options for operation could function with \njust a gas supply hookup, most gas stoves require a 110 V \nsupply outlet to power clocks, ignition sources, \nprogrammable features, and oven lighting.\nOperating Pressure\nGas supply pressure is normally higher than that required for \nburner operation. An appliance pressure regulator is used to \nreduce the supply pressure to the manifold pressure \nrequired at the burner and maintain it at that level.\nIt is important to maintain the correct manifold pressure \nsetting in order to avoid service problems and hazardous \nconditions such as delayed ignition, sooting, flashback, \nextinction pop, damage to components, poor operating \nefficiency, and limit cycling.\nGas Pressure Requirements\n7\nNatural Gas Inlet\nTypical inlet pressure in inches w.c. (1.5 kPa)\n11\nPropane Inlet\nTypical inlet pressure in inches w.c. (2.7 kPa)\n3.5-5\nNatural Gas Manifold\nTypical outlet pressure in inches w.c. (0.9-1.25 kPa)\n10\nPropane Manifold\nTypical outlet pressure in inches w.c. (2.5 kPa)\nThe regulator is usually pre-adjusted for use with the type of gas specified on the rating plate and for a specific outlet pressure. Many \nranges come with a regulator that is adjustable for use with propane or natural gas.\nCode Requirements\nElectrical Connections\nMost gas ranges require electricity to power clocks, timers, \nand other control devices. The electrical connection is usually \n120 V 60 Hz, two-wire, with ground. The minimum size and \ntype of wire that can be used for a 120 V, 15 A indoor appliance \nis No.14 AWG NMD-90.\nPiping Connections\nThe Code requirements for gas range piping and tubing \nconnections can be found in CSA B149.1, which will be \nreferred to as the Code.\nRigid piping or flexible connectors may be used to connect \nranges to the gas supply. Metal (flexible) connectors must be \ninstalled in accordance with Code requirements.\nElectrical Connection Requirements\n1\nProper Connections\nAll electrical connections between \nan appliance and the building \nwiring must comply with \napplicable electrical codes. \nConnection of all electrical devices \nassociated with the appliance \nmust follow the manufacturer's \nwiring diagram.\n2\nPower Supply Cord\nA range must be connected to the \nelectrical circuit receptacle by \nmeans of an approved power \nsupply cord with a three-prong \ngrounding plug. Extension cords \nmay not be used.\n3\nGrounding\nUnder no circumstances should \nthe grounding prong of a power \nsupply cord be removed or \nreplaced with a two-prong plug or \nadapter.\nFlexible Connector Requirements\nProtection\nConnectors must be protected from potential damage.\nNo Passing Through Barrier",
          "content_truncated": true
        },
        {
          "filename": "CSA Unit 15 - Question Bank.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances",
          "char_count": 21792,
          "content": "CSA Unit 15 - Domestic Appliances Test (120 Questions)\nGas Ranges: Installation and Servicing\nWhat is the typical natural gas manifold operating pressure at the burner for residential installations? a) 7 inches w.c. (1.75 kPa) b) 3.5-5 inches w.c. (0.9-1.25 kPa) c) 11 inches w.c. (2.7 kPa) d) 10 inches w.c. (2.5 kPa)\nWhat is the typical propane manifold operating pressure? a) 3.5 inches w.c. (0.9 kPa) b) 7 inches w.c. (1.75 kPa) c) 10 inches w.c. (2.5 kPa) d) 11 inches w.c. (2.7 kPa)\nWhat device prevents accidental tipping of a range? a) Spider guard b) Anti-tipping device c) Appliance regulator d) Drill Manufacturer's Standard\nWhat is the minimum electrical wire size for a 120V, 15A indoor appliance? a) No. 12 AWG NMD-90 b) No. 14 AWG NMD-90 c) No. 16 AWG NMD-90 d) No. 10 AWG NMD-90\nAccording to the Code, what is the minimum clearance for a range's back and sides from combustible surfaces if not specified by the manufacturer? a) 100 mm b) 125 mm c) 150 mm d) 200 mm\nWhat type of metal shield is required for combustible cabinets next to a range cooking surface? a) 26 MSG metal shield b) 28 MSG metal shield c) 30 MSG metal shield d) 32 MSG metal shield\nFor zero clearance ranges, what is the minimum space required between the back of the range and a combustible surface? a) 0.5 inch (12 mm) b) 1 inch (25 mm) c) 1.5 inches (38 mm) d) 2 inches (50 mm)\nWhat voltage should be measured between line and neutral conductors at a range receptacle? a) 110V ±10% b) 115V ±10% c) 120V ±10% d) 125V ±10%\nWhat voltage should be measured between neutral and ground conductors at a range receptacle? a) 0V b) 12V c) 24V d) 120V\nWhat does DMS stand for in orifice sizing? a) Drill Manufacturing Standard b) Drill Manufacturer's Standard c) Direct Manufacturing System d) Direct Measurement Standard\nWhat is the smallest orifice size in the DMS system? a) No. 1 b) No. 60 c) No. 80 d) No. 100\nWhat is the largest orifice size in the DMS system? a) A b) Z c) No. 1 d) No. 80\nWhat is the typical natural gas supply pressure at the outlet of the gas meter? a) 3.5 inches w.c. (0.9 kPa) b) 5 inches w.c. (1.25 kPa) c) 7 inches w.c. (1.75 kPa) d) 11 inches w.c. (2.74 kPa)\nWhat is the typical propane inlet pressure? a) 7 inches w.c. (1.75 kPa) b) 10 inches w.c. (2.5 kPa) c) 11 inches w.c. (2.74 kPa) d) 15 inches w.c. (3.7 kPa)\nWhich type of burner has a series of thin slots that distribute the flame? a) Ribbon port burner b) Slotted port burner c) Sealed burner d) Standard burner\nWhat is the operating temperature of a hot surface igniter? a) 1800°F (982°C) b) 2000°F (1093°C) c) 2200°F (1204°C) d) 2400°F (1316°C)\nWhat happens when a self-cleaning cycle is selected on an oven? a) The oven door unlocks b) The oven door locks c) The burner turns off d) The temperature decreases\nWhat temperature does a self-cleaning oven reach during the cleaning cycle? a) 750°F (400°C) b) 850°F (454°C) c) 950°F (510°C) d) 1050°F (566°C)\nIn a forced convection oven, what circulates the heat? a) Natural air currents b) A fan c) The burner flame d) The oven door\nWhat is the maximum temperature difference acceptable between set point and actual oven temperature during calibration? a) 5°F (3°C) b) 10°F (5°C) c) 15°F (8°C) d) 20°F (11°C)\nWhat is the typical amperage draw for a Carborundum (round) ignitor? a) 2.0 to 2.5 amps b) 2.5 to 3.0 amps c) 3.2 to 3.6 amps d) 3.5 to 4.0 amps\nWhat is the typical amperage draw for a Norton (flat) ignitor? a) 2.0 to 2.5 amps b) 2.5 to 3.0 amps c) 3.2 to 3.6 amps d) 3.5 to 4.0 amps\nWhat voltage drop across the safety valve indicates it will open in a hot surface igniter system? a) 2V b) 3V c) 4V d) 5V\nWhat should the cold resistance of a hot surface igniter be? a) 25-50 Ohms b) 50-150 Ohms c) 150-250 Ohms d) 250-350 Ohms\nHow should the thermostat calibration screw be turned to decrease temperature? a) Clockwise b) Counter-clockwise c) Either direction d) It cannot be adjusted\nWhat is the adjustment range for an oven temperature setting knob? a) ±25°F (±15°C) b) ±35°F (±20°C) c) ±50°F (±30°C) d) ±75°F (±42°C)\nWhat should a properly adjusted pilot flame length be? a) 0.125 to 0.5 inch (3-12 mm) b) 0.25 to 1 inch (6-25 mm) c) 0.5 to 1.5 inches (12-38 mm) d) 1 to 2 inches (25-50 mm)\nHow long should a pilot flame take to ignite the oven burner? a) Within 0.5 seconds b) Within 1 second c) Within 2 seconds d) Within 3 seconds\nGas Clothes Dryers: Installation, Operation, and Maintenance\nWhat are the clearance requirements for domestic dryers from combustible materials at the back and sides? a) 4 inches (100 mm) b) 6 inches (150 mm) c) 8 inches (200 mm) d) 12 inches (300 mm)\nWhat is the front clearance requirement for domestic dryers? a) 18 inches (450 mm) b) 20 inches (500 mm) c) 24 inches (600 mm) d) 30 inches (750 mm)\nWhat is the typical inlet pressure for a dryer operating on natural gas? a) 4 inches w.c. (1.0 kPa) b) 6 inches w.c. (1.5 kPa) c) 8 inches w.c. (2.0 kPa) d) 10 inches w.c. (2.5 kPa)\nWhat is the typical inlet pressure for a dryer operating on propane? a) 6 inches w.c. (1.5 kPa) b) 8 inches w.c. (2.0 kPa) c) 10 inches w.c. (2.5 kPa) d) 12 inches w.c. (3.0 kPa)\nWhat is the balancing pressure typically set at for a dryer regulator? a) 2.5 inches w.c. (0.6 kPa) b) 3.5 inches w.c. (0.9 kPa) c) 4.5 inches w.c. (1.1 kPa) d) 5.5 inches w.c. (1.4 kPa)\nWhat is the minimum diameter for a dryer exhaust vent? a) 3 inches (76 mm) b) 4 inches (102 mm) c) 5 inches (127 mm) d) 6 inches (152 mm)\nWhat is the minimum distance the exhaust hood should be from the ground? a) 8 inches (200 mm) b) 10 inches (250 mm) c) 12 inches (300 mm) d) 15 inches (375 mm)\nWhat is the termination distance required from regulator vents or fresh air intakes for domestic dryers? a) 0.5 m b) 1 m c) 2 m d) 3 m\nWhat is the termination distance required from fresh air intakes for commercial dryers? a) 1 m b) 2 m c) 3 m d) 4 m\nWhat should be used to connect moisture exhaust duct joints? a) Sheet metal screws b) Duct tape c) Wire ties d) Clamps only\nWhat is the maximum length of rigid metal vent with no elbows? a) 54 ft (16.5 m) b) 64 ft (19.5 m) c) 74 ft (22.5 m) d) 84 ft (25.6 m)\nWhat is the maximum length of flexible metal vent with no elbows? a) 26 ft (7.9 m) b) 36 ft (11.0 m) c) 46 ft (14.0 m) d) 56 ft (17.1 m)\nAt what speed should a dryer drum rotate? a) 35-40 rpm b) 42-45 rpm c) 47-50 rpm d) 52-55 rpm\nWhat is the operating temperature of a Glo-sil igniter? a) 2000°F (1093°C) b) 2100°F (1149°C) c) 2200°F (1204°C) d) 2300°F (1260°C)\nHow long should a Glo-sil igniter take to reach operating temperature? a) 5-15 seconds b) 10-20 seconds c) 15-30 seconds d) 20-35 seconds\nWhat should the resistance across a good Glo-sil igniter be? a) 25-50 Ω b) 50-125 Ω c) 125-200 Ω d) 200-300 Ω\nWhat is the typical high limit switch setting for dryer temperature controls? a) 160-190°F (71-88°C) b) 170-200°F (77-93°C) c) 190-250°F (88-121°C) d) 200-280°F (93-138°C)\nWhat must a dryer do if the door is opened during operation? a) Continue running b) Sound an alarm c) Stop the drum and burner d) Only stop the drum\nWhat happens to the warp switch in a glow coil system after 3-4 minutes? a) It closes b) It opens c) It resets automatically d) It continues operating normally\nWhat is the normal motor speed when the centrifugal switch closes in a dryer? a) 1000 rpm b) 1100 rpm c) 1200 rpm d) 1300 rpm\nBarbecues\nWhat is the maximum length of hose that can be used for barbecue connections? a) 8 ft (2.4 m) b) 10 ft (3 m) c) 12 ft (3.7 m) d) 15 ft (4.6 m)\nWhere must the shut-off valve for a barbecue be installed? a) At the barbecue b) Inside the house c) Immediately upstream of the hose d) At the gas meter\nWhat is the minimum distance between shut-off valve handles on independent connections? a) 4 inches (100 mm) b) 6 inches (150 mm) c) 8 inches (200 mm) d) 10 inches (250 mm)\nWhat temperature should hoses be protected from exceeding? a) 100°F (38°C) b) 125°F (52°C) c) 150°F (66°C) d) 175°F (79°C)\nWhat prevents spiders and other insects from nesting in burner tubes? a) Air shutter b) Spider guard c) Venturi tube d) Orifice\nWhat is the primary purpose of a quick disconnect fitting? a) To replace a manual shut-off valve b) To provide convenient connection/disconnection c) To regulate gas pressure d) To prevent gas leaks\nWhat should be done before disconnecting a barbecue with a quick disconnect? a) Light all burners b) Close the shut-off valve c) Remove the propane tank d) Clean the fitting\nWhat is the ideal barbecue flame color? a) Completely yellow b) Blue with slight yellow tips c) Completely blue d) Orange with blue base\nAt what temperature can an infrared burner heat in approximately three minutes? a) 800°F (427°C) b) 900°F (482°C) c) 1000°F (538°C) d) 1100°F (593°C)\nWhat should always be done before lighting a barbecue? a) Remove the cooking grates b) Open the lid c) Close all vents d) Remove the propane tank\nWhat is the correct procedure for extinguishing a barbecue? a) Turn off burner controls first, then gas supply b) Turn off gas supply first, then burner controls c) Turn off both simultaneously d) Close the lid first\nWhat can cause flame flashback beneath the control panel? a) Low gas pressure b) Blocked venturi tube c) Faulty igniter d) Loose connections\nGas Lamps: Installation, Components, Operation, and Servicing\nWhat is the minimum clearance above a bracket or pendant gas lamp fixture from combustible material? a) 12 in (300 mm) b) 15 in (375 mm) c) 18 in (450 mm) d) 24 in (600 mm)\nWhat is the minimum clearance on all sides of a gas lamp from combustible material? a) 3 in (75 mm) b) 4 in (100 mm) c) 5 in (125 mm) d) 6 in (150 mm)\nWhat pressure do most gas lamps without regulators operate at for natural gas? a) 5 inches w.c. b) 6 inches w.c. c) 7 inches w.c. d) 8 inches w.c.\nWhat device generates bright white light when heated by a flame in a gas lamp? a) Venturi b) Gas mantle c) Electrode d) Photosensor\nWhat are the two basic types of mantles? a) Hard and soft b) Soft and preformed hard c) Natural an",
          "content_truncated": true
        },
        {
          "filename": "DRYER Symbols.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances",
          "char_count": 140,
          "content": "DRYER Symbols\nDryer Heat Thermostat\nDryer High Limit Switch\nDryer Gas Solenoid\nDryer Timer Motor\nDryer Centrifugal Switch\nDryer Pilot Switch",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_01_Ranges_STUD.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments",
          "char_count": 3092,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 01: Ranges \n \n1. What information found on the rating plate needed to determine the correct pipe size and \ncheck individual burner gas flow? \na) Input rating \nb) Manifold pressure  \nc) Operating voltage \nd) Minimum supply pressure \n \n2. The appliance regulator is usually pre-adjusted for use with the type of gas specified on the \nrating plate and for a specific outlet pressure. \na) True \nb) False \n \n3. How are gas ranges typically connected to the electrical power supply? \na) A three phase 4 wire cable \nb) Hard wired into a junction box with armoured cable \nc) A power supply cord with a 120 VAC three-prong grounded plug \nd) A power supply cord with a 240 VAC three-prong grounded plug \n \n4. The appliance regulator on a range is adjusted by changing the position of a simple \nconverter fitting. \na) True \nb) False \n \n5. How is the final connection to the gas supply manifold done to provide for movement of the \ngas range in order to clean behind it? \na) A maximum 0.6 m long flexible metal gas connector \nb) A maximum 1.0 m long flexible metal gas connector  \nc) A maximum 2.0 m long flexible metal gas connector  \nd) A maximum 3.0 m long flexible metal gas connector\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n2 \n6. To determine the required clearance to combustibles for a range, refer to the gas code over \nthe manufacturer’s instructions or the rating plate. \na) True \nb) False \n \n7. What is the allowable clearance to combustibles for a range certified for zero clearance \n(without additional protection)? \na) 600mm above, 25 mm at the back \nb) 750mm above, 25 mm at the back \nc) 600mm above, 150 mm at the back \nd) 750mm above, 150 mm at the back \n \n8. If you have three certified metal flexible connectors of different lengths, they will all have \nthe same gas flow capacity. \na) True \nb) False \n \n9. When checking the manifold pressure, there must be gas flowing to properly read and \nadjust pressures. \na) True \nb) False \n \n10. How does a sealed gas burner design maintain clean burner ports? \na) Burner cap collects debris \nb) Flash tube burns of debris. \nc) Integrated drip pan gets removed and cleaned  \nd) Burner cap deflects debris away from the flame \n \n11. How is the oven temperature recalibrated on mechanical style gas ovens that do not have \nadjustable thermostats? \na) Adjust the temperature setting knob \nb) Change the gas orifices \nc) Adjust the manifold pressure \nd) Factory setting cannot be changed\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n3 \n12. How long should a gas range operate before adjusting the oven temperature calibration? \na) 1 minute \nb) 5 minutes \nc) 15 minutes \nd) 30 minutes \n \n13. A properly adjusted burner flame should extend high enough so that the inner blue cone of \nthe flame is above the burner ring or grate, and able to touch the cooking vessel. \na) True \nb) False",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_02_Cloths_dryers_STUD.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments",
          "char_count": 1989,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 02: Clothes dryers \n \n1. If there are no manufacturer's rating plate clearances, what are the allowable code \nclearances to combustibles from the top, back and sides of a domestic gas dryer? \na) 50 mm \nb) 150 mm \nc) 450 mm \nd) 600 mm \n \n2. What is the maximum length of a metal connector used to connect a gas dryer? \na) A maximum 0.6 m long flexible metal gas connector \nb) A maximum 1.0 m long flexible metal gas connector  \nc) A maximum 2.0 m long flexible metal gas connector  \nd) A maximum 3.0 m long flexible metal gas connector \n \n3. What should be used to connect dryer moisture exhaust duct joints? \na) Foil duct tape \nb) Electrical tape \nc) Cloth mesh duct tape \nd) Three evenly spaced sheet metal screws \n \n4. The moisture exhaust duct can be connected to another gas appliance vent connector to \ncreate a common vent. \na) True \nb) False \n \n5. How far above ground level should the exhaust hood terminate? \na) 200 mm \nb) 300mm \nc) 500 mm \nd) 1000 mm\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n2 \n6. What determines the maximum length of the exhaust system? \na) Type of exhaust hood \nb) Type of vent material \nc) Number of elbows \nd) All of the choices  \n \n7. What will cause a gas dryer to keep running after its door is opened? \na) Faulty door switch \nb) Faulty booster coil \nc) Faulty holding coil \nd) Defective centrifugal switch \n \n8. What problem would a defective drum seal cause? \na) Dryer smokes \nb) Clothes drying too slowly \nc) Drum operates, but noisily \nd) Main burner does not light \n \n9. What is the minimum exhaust vent diameter for a gas dryer? \na) 3 inch  \nb) 4 inch \nc) 5 inch \nd) 6 inch \n \n10. What problem would be caused by the dryer not being level? \na) Dryer smokes \nb) Clothes drying too slowly \nc) Drum operates, but noisily \nd) Main burner does not light",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_03_Barbecues_STUD.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments",
          "char_count": 700,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 03: Barbecues \n \n1. Most barbecues can be used on Propane or natural gas without any modifications. \na) True \nb) False \n \n2. A shut-off valve is not necessary when using a quick disconnect device? \na) True \nb) False \n \n3. Barbecues equipped with a piezo ignition can be match-lit? \na) True \nb) False \n \n4. Aftermarket spider guard can be installed onto burner tubes. \na) True \nb) False \n \n5. During the lighting of a barbecue, the lid must be closed. \na) True \nb) False \n \n6. What is the maximum length of a barbeque connecting hose? \na) 0.6 m \nb) 2 m \nc) 3 m \nd) 4.6 m",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_04_Lamps_STUD.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments",
          "char_count": 665,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 04: Lamps \n \n1. Soft mantles are more durable than hard mantles due to their flexibility. \na) True \nb) False \n \n2. The purpose of the venturi assembly is to generate bright white light when heated by the \nflame. \na) True \nb) False \n \n3. Indoor gas lamps should only be used in well ventilated rooms. \na) True \nb) False \n \n4. Before starting any repairs, you should turn off the gas supply and allow the glass to cool. \na) True \nb) False \n \n5. How often should a gas lamp be cleaned? \na) Weekly \nb) Monthly \nc) Annually \nd) Bi-annually",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_01_Ranges_INST.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments\\Answer Keys",
          "char_count": 3092,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 01: Ranges \n \n1. What information found on the rating plate needed to determine the correct pipe size and \ncheck individual burner gas flow? \na) Input rating \nb) Manifold pressure  \nc) Operating voltage \nd) Minimum supply pressure \n \n2. The appliance regulator is usually pre-adjusted for use with the type of gas specified on the \nrating plate and for a specific outlet pressure. \na) True \nb) False \n \n3. How are gas ranges typically connected to the electrical power supply? \na) A three phase 4 wire cable \nb) Hard wired into a junction box with armoured cable \nc) A power supply cord with a 120 VAC three-prong grounded plug \nd) A power supply cord with a 240 VAC three-prong grounded plug \n \n4. The appliance regulator on a range is adjusted by changing the position of a simple \nconverter fitting. \na) True \nb) False \n \n5. How is the final connection to the gas supply manifold done to provide for movement of the \ngas range in order to clean behind it? \na) A maximum 0.6 m long flexible metal gas connector \nb) A maximum 1.0 m long flexible metal gas connector  \nc) A maximum 2.0 m long flexible metal gas connector  \nd) A maximum 3.0 m long flexible metal gas connector\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n2 \n6. To determine the required clearance to combustibles for a range, refer to the gas code over \nthe manufacturer’s instructions or the rating plate. \na) True \nb) False \n \n7. What is the allowable clearance to combustibles for a range certified for zero clearance \n(without additional protection)? \na) 600mm above, 25 mm at the back \nb) 750mm above, 25 mm at the back \nc) 600mm above, 150 mm at the back \nd) 750mm above, 150 mm at the back \n \n8. If you have three certified metal flexible connectors of different lengths, they will all have \nthe same gas flow capacity. \na) True \nb) False \n \n9. When checking the manifold pressure, there must be gas flowing to properly read and \nadjust pressures. \na) True \nb) False \n \n10. How does a sealed gas burner design maintain clean burner ports? \na) Burner cap collects debris \nb) Flash tube burns of debris. \nc) Integrated drip pan gets removed and cleaned  \nd) Burner cap deflects debris away from the flame \n \n11. How is the oven temperature recalibrated on mechanical style gas ovens that do not have \nadjustable thermostats? \na) Adjust the temperature setting knob \nb) Change the gas orifices \nc) Adjust the manifold pressure \nd) Factory setting cannot be changed\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n3 \n12. How long should a gas range operate before adjusting the oven temperature calibration? \na) 1 minute \nb) 5 minutes \nc) 15 minutes \nd) 30 minutes \n \n13. A properly adjusted burner flame should extend high enough so that the inner blue cone of \nthe flame is above the burner ring or grate, and able to touch the cooking vessel. \na) True \nb) False",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_02_Cloths_dryers_INST.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments\\Answer Keys",
          "char_count": 1989,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 02: Clothes dryers \n \n1. If there are no manufacturer's rating plate clearances, what are the allowable code \nclearances to combustibles from the top, back and sides of a domestic gas dryer? \na) 50 mm \nb) 150 mm \nc) 450 mm \nd) 600 mm \n \n2. What is the maximum length of a metal connector used to connect a gas dryer? \na) A maximum 0.6 m long flexible metal gas connector \nb) A maximum 1.0 m long flexible metal gas connector  \nc) A maximum 2.0 m long flexible metal gas connector  \nd) A maximum 3.0 m long flexible metal gas connector \n \n3. What should be used to connect dryer moisture exhaust duct joints? \na) Foil duct tape \nb) Electrical tape \nc) Cloth mesh duct tape \nd) Three evenly spaced sheet metal screws \n \n4. The moisture exhaust duct can be connected to another gas appliance vent connector to \ncreate a common vent. \na) True \nb) False \n \n5. How far above ground level should the exhaust hood terminate? \na) 200 mm \nb) 300mm \nc) 500 mm \nd) 1000 mm\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n2 \n6. What determines the maximum length of the exhaust system? \na) Type of exhaust hood \nb) Type of vent material \nc) Number of elbows \nd) All of the choices  \n \n7. What will cause a gas dryer to keep running after its door is opened? \na) Faulty door switch \nb) Faulty booster coil \nc) Faulty holding coil \nd) Defective centrifugal switch \n \n8. What problem would a defective drum seal cause? \na) Dryer smokes \nb) Clothes drying too slowly \nc) Drum operates, but noisily \nd) Main burner does not light \n \n9. What is the minimum exhaust vent diameter for a gas dryer? \na) 3 inch  \nb) 4 inch \nc) 5 inch \nd) 6 inch \n \n10. What problem would be caused by the dryer not being level? \na) Dryer smokes \nb) Clothes drying too slowly \nc) Drum operates, but noisily \nd) Main burner does not light",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_03_Barbecues_INST.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments\\Answer Keys",
          "char_count": 700,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 03: Barbecues \n \n1. Most barbecues can be used on Propane or natural gas without any modifications. \na) True \nb) False \n \n2. A shut-off valve is not necessary when using a quick disconnect device? \na) True \nb) False \n \n3. Barbecues equipped with a piezo ignition can be match-lit? \na) True \nb) False \n \n4. Aftermarket spider guard can be installed onto burner tubes. \na) True \nb) False \n \n5. During the lighting of a barbecue, the lid must be closed. \na) True \nb) False \n \n6. What is the maximum length of a barbeque connecting hose? \na) 0.6 m \nb) 2 m \nc) 3 m \nd) 4.6 m",
          "content_truncated": false
        },
        {
          "filename": "Assignments_GT2_15_04_Lamps_INST.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Assignments\\Answer Keys",
          "char_count": 665,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association  \n \n1 \nUnit 15 – Chapter 04: Lamps \n \n1. Soft mantles are more durable than hard mantles due to their flexibility. \na) True \nb) False \n \n2. The purpose of the venturi assembly is to generate bright white light when heated by the \nflame. \na) True \nb) False \n \n3. Indoor gas lamps should only be used in well ventilated rooms. \na) True \nb) False \n \n4. Before starting any repairs, you should turn off the gas supply and allow the glass to cool. \na) True \nb) False \n \n5. How often should a gas lamp be cleaned? \na) Weekly \nb) Monthly \nc) Annually \nd) Bi-annually",
          "content_truncated": false
        },
        {
          "filename": "Review  for Module 14 rev. 2018.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Exams\\Old",
          "char_count": 4850,
          "content": "Gas Tech II level 3\nReview for Module 14\nDomestic Appliances\nSections of moisture exhaust duct on a dryer are held together using:\nLocking bands\nDuct tape.\nMetal screws.\nWire mesh.\nA moisture exhaust duct on a residential dryer and a service regulator must be a minimum distance of:\n36 inches apart\n12 inches apart\n48 inches apart\n24 inches apart\nGas dryers are required to be vented:\nThrough a hepa filter\nTo the outdoors\nTo a filtered container outdoors\nTo  a heat recovery ventilation unit\nDryer exhaust ducts must not be screwed together.\nTrue\nFalse\nDryer exhaust ducts must joined using duct tape.\nTrue\nFalse\nA pendant type gas lamp requires a side clearance from combustibles of:\n12 inches\n0 inches\n5 inches\n18 inches\nThe minimum top clearance from combustibles for a domestic gas range is?\n24 inches\n30 inches\n36 inches\n48 inches\nAt what temperature does a self-cleaning range activate the door lock switch?\n212 deg. F.\n450 deg. F.\n650 deg. F.\n900 deg. F.\nIdentify the following electrical dryer symbol\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nThe purpose of a mantle on a gas lamp is to:\nChange a blue flame to a luminous flame\nAct as a manifold device\nProtect the lighter mechanism\nIgnite the air/gas mixture\nThe maximum length of a corrugated metal connector for a gas range is:\n5 feet\n8 feet\n6 feet\n24 inches\nWhat function does the minimum burner flame have on a direct acting modulating oven control?\nIt prevents rapid cooling of the oven temperature\nIt prevents excess oven temperature fluctuation\nIt makes perfect pies\nIt maintains a minimum oven temperature\nThe spark on a spark ignition dryer is de-energized by:\nThermocouple\nA main burner switch\nA flame switch\nA thermo-meter\nA dryer motor switches from start to run mode utilizing what?\nCapacitor\nCentrifugal switch\nLow limit switch\nThermostat\nWhat is the maximum length of an approved hose for a gas fired barbecue?\nTwo feet.\nAny length.\nThirty Feet.\nFor standing pilot, three feet, for piezo ignited, six Feet.\nA range burner with a control valve located at the rear of the range shall not be installed unless:\nThe  valve is readily accessible\nThe valve is readily inaccessible\nThe valve is rated for excessive temperatures\nThe valve is of the lubricated plug type\nWhen a flexible metal connector is used to connect the domestic appliance to rigid piping, where shall a shutoff valve be installed in the piping system?\nImmediately upstream of the flexible  connector\nImmediately downstream of the flexible  connector\nImmediately downstream of the appliance regulator\nA shut off valve s not required when using a flexible  connector\nDuring the lighting of a barbecue what position should the lid be in?\nClosed\nOpen\nEither A or B\nNone of the above\nEach season before a barbecue is used, what must be done?\nLines must be isolated and pressure tested - 15 minutes at 15 psig\nA visual inspection must be conducted to ensure that all piping and tubing is sound and that there are no visible faults\nA visual inspection must be conducted to ensure that burner primary air openings are free of insects or debris\nBoth A and C\nNone of the above\nHow often should a gas lamp be cleaned\nEvery 6 months\nEvery year\nEvery two years\nNone of the above\nWhat could cause insufficient drying in a domestic clothes dryer, even if the lint screen is kept clean?\nBlocked vent\nDefective drum seal\nBlocked air flow in dryer\nDryer firing below rated input\nAll of the above\nAdding an excessive number of lava rocks or briquettes to a barbeque:\nCan cause food to burn quickly\nMay undercook food\nMay cause premature burner burn-out\nNone of the above.\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer timer motor\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nHow are barbeques lit?\nPiezo ignition system\nHot surface ignition system\nMatch-light\nA or C\nNone of the above\nHow long should a gas range operate before calibrating the oven temperature control?\n15-20 minutes\n5-10\n50 minutes\n30-45 minutes\nNone of the above\nA free-standing residential gas-fired range is:\nBuilt-into the counter space\nNot built-in or permanently installed\nDropped into the counter space\nNone of the above",
          "content_truncated": false
        },
        {
          "filename": "Review Exam for Module 14 Answers rev. 04-20-11.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Exams\\Old",
          "char_count": 4934,
          "content": "Gas Technician 2\nReview Exam for Module 14\nDomestic Appliances\nInstructor Copy\nExam #_____________________\nDo not remove exam from the classroom\nSections of moisture exhaust duct on a dryer are held together using:\nLocking bands\nDuct tape.\nMetal screws.\nWire mesh.\nA moisture exhaust duct on a residential dryer and a service regulator must be a minimum distance of:\n36 inches apart\n12 inches apart\n48 inches apart\n24 inches apart\nGas dryers are required to be vented:\nThrough a hepa filter\nTo the outdoors\nTo a filtered container outdoors\nTo  a heat recovery ventilation unit\nDryer exhaust ducts must not be screwed together.\nTrue\nFalse\nDryer exhaust ducts must joined using duct tape.\nTrue\nFalse\nA pendant type gas lamp requires a side clearance from combustibles of:\n12 inches\n0 inches\n5 inches\n18 inches\nThe minimum top clearance from combustibles for a domestic gas range is?\n24 inches\n30 inches\n36 inches\n48 inches\nAt what temperature does a self-cleaning range activate the door lock switch?\n212 deg. F.\n450 deg. F.\n650 deg. F.\n900 deg. F.\nIdentify the following electrical dryer symbol\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nThe purpose of a mantle on a gas lamp is to:\nChange a blue flame to a luminous flame\nAct as a manifold device\nProtect the lighter mechanism\nIgnite the air/gas mixture\nThe maximum length of a corrugated metal connector for a gas range is:\n5 feet\n8 feet\n6 feet\n24 inches\nWhat function does the minimum burner flame have on a direct acting modulating oven control?\nIt prevents rapid cooling of the oven temperature\nIt prevents excess oven temperature fluctuation\nIt makes perfect pies\nIt maintains a minimum oven temperature\nThe spark on a spark ignition dryer is de-energized by:\nThermocouple\nA main burner switch\nA flame switch\nA thermo-meter\nA dryer motor switches from start to run mode utilizing what?\nCapacitor\nCentrifugal switch\nLow limit switch\nThermostat\nWhat is the maximum length of an approved hose for a gas fired barbecue?\nTwo feet.\nAny length.\nThirty Feet.\nFor standing pilot, three feet, for piezo ignited, six Feet.\nA range burner with a control valve located at the rear of the range shall not be installed unless:\nThe  valve is readily accessible\nThe valve is readily inaccessible\nThe valve is rated for excessive temperatures\nThe valve is of the lubricated plug type\nWhen a flexible metal connector is used to connect the domestic appliance to rigid piping, where shall a shutoff valve be installed in the piping system?\nImmediately upstream of the flexible  connector\nImmediately downstream of the flexible  connector\nImmediately downstream of the appliance regulator\nA shut off valve s not required when using a flexible  connector\nDuring the lighting of a barbecue what position should the lid be in?\nClosed\nOpen\nEither A or B\nNone of the above\nEach season before a barbecue is used, what must be done?\nLines must be isolated and pressure tested - 15 minutes at 15 psig\nA visual inspection must be conducted to ensure that all piping and tubing is sound and that there are no visible faults\nA visual inspection must be conducted to ensure that burner primary air openings are free of insects or debris\nBoth B and C\nNone of the above\nHow often should a gas lamp be cleaned\nEvery 6 months\nEvery year\nEvery two years\nNone of the above\nWhat could cause insufficient drying in a domestic clothes dryer, even if the lint screen is kept clean?\nBlocked vent\nDefective drum seal\nBlocked air flow in dryer\nDryer firing below rated input\nAll of the above\nAdding an excessive number of lava rocks or briquettes to a barbeque:\nCan cause food to burn quickly\nMay undercook food\nMay cause premature burner burn-out\nNone of the above.\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer timer motor\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nHow are barbeques lit?\nPiezo ignition system\nHot surface ignition system\nMatch-light\nA or C\nNone of the above\nHow long should a gas range operate before calibrating the oven temperature control?\n15-20 minutes\n5-10\n50 minutes\n30-45 minutes\nNone of the above\nA free-standing residential gas-fired range is:\nBuilt-into the counter space\nNot built-in or permanently installed\nDropped into the counter space\nNone of the above",
          "content_truncated": false
        },
        {
          "filename": "Review Exam for Module 14 rev. 03-16-11.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Exams\\Old",
          "char_count": 4918,
          "content": "Gas Technician 2\nReview Exam for Module 14\nDomestic Appliances\nExam #_____________________\nDo not remove exam from the classroom\nSections of moisture exhaust duct on a dryer are held together using:\nLocking bands\nDuct tape.\nMetal screws.\nWire mesh.\nA moisture exhaust duct on a residential dryer and a service regulator must be a minimum distance of:\n36 inches apart\n12 inches apart\n48 inches apart\n24 inches apart\nGas dryers are required to be vented:\nThrough a hepa filter\nTo the outdoors\nTo a filtered container outdoors\nTo  a heat recovery ventilation unit\nDryer exhaust ducts must not be screwed together.\nTrue\nFalse\nDryer exhaust ducts must joined using duct tape.\nTrue\nFalse\nA pendant type gas lamp requires a side clearance from combustibles of:\n12 inches\n0 inches\n5 inches\n18 inches\nThe minimum top clearance from combustibles for a domestic gas range is?\n24 inches\n30 inches\n36 inches\n48 inches\nAt what temperature does a self-cleaning range activate the door lock switch?\n212 deg. F.\n450 deg. F.\n650 deg. F.\n900 deg. F.\nIdentify the following electrical dryer symbol\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nThe purpose of a mantle on a gas lamp is to:\nChange a blue flame to a luminous flame\nAct as a manifold device\nProtect the lighter mechanism\nIgnite the air/gas mixture\nThe maximum length of a corrugated metal connector for a gas range is:\n5 feet\n8 feet\n6 feet\n24 inches\nWhat function does the minimum burner flame have on a direct acting modulating oven control?\nIt prevents rapid cooling of the oven temperature\nIt prevents excess oven temperature fluctuation\nIt makes perfect pies\nIt maintains a minimum oven temperature\nThe spark on a spark ignition dryer is de-energized by:\nThermocouple\nA main burner switch\nA flame switch\nA thermo-meter\nA dryer motor switches from start to run mode utilizing what?\nCapacitor\nCentrifugal switch\nLow limit switch\nThermostat\nWhat is the maximum length of an approved hose for a gas fired barbecue?\nTwo feet.\nAny length.\nThirty Feet.\nFor standing pilot, three feet, for piezo ignited, six Feet.\nA range burner with a control valve located at the rear of the range shall not be installed unless:\nThe  valve is readily accessible\nThe valve is readily inaccessible\nThe valve is rated for excessive temperatures\nThe valve is of the lubricated plug type\nWhen a flexible metal connector is used to connect the domestic appliance to rigid piping, where shall a shutoff valve be installed in the piping system?\nImmediately upstream of the flexible  connector\nImmediately downstream of the flexible  connector\nImmediately downstream of the appliance regulator\nA shut off valve s not required when using a flexible  connector\nDuring the lighting of a barbecue what position should the lid be in?\nClosed\nOpen\nEither A or B\nNone of the above\nEach season before a barbecue is used, what must be done?\nLines must be isolated and pressure tested - 15 minutes at 15 psig\nA visual inspection must be conducted to ensure that all piping and tubing is sound and that there are no visible faults\nA visual inspection must be conducted to ensure that burner primary air openings are free of insects or debris\nBoth A and C\nNone of the above\nHow often should a gas lamp be cleaned\nEvery 6 months\nEvery year\nEvery two years\nNone of the above\nWhat could cause insufficient drying in a domestic clothes dryer, even if the lint screen is kept clean?\nBlocked vent\nDefective drum seal\nBlocked air flow in dryer\nDryer firing below rated input\nAll of the above\nAdding an excessive number of lava rocks or briquettes to a barbeque:\nCan cause food to burn quickly\nMay undercook food\nMay cause premature burner burn-out\nNone of the above.\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer timer motor\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nIdentify the following electrical dryer symbol.\nDryer heat thermostat\nDryer gas solenoid\nDryer centrifugal switch\nDryer high limit switch\nDryer pilot switch\nHow are barbeques lit?\nPiezo ignition system\nHot surface ignition system\nMatch-light\nA or C\nNone of the above\nHow long should a gas range operate before calibrating the oven temperature control?\n15-20 minutes\n5-10\n50 minutes\n30-45 minutes\nNone of the above\nA free-standing residential gas-fired range is:\nBuilt-into the counter space\nNot built-in or permanently installed\nDropped into the counter space\nNone of the above",
          "content_truncated": false
        },
        {
          "filename": "Lab #1 - Gas Range - Answers.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Lab Practicals",
          "char_count": 5869,
          "content": "Gas Range Practical\nLearning Outcome:\nUpon completion of this shop project, you will understand the electrical and gas connections, sequence of operation, components, and general usage of a gas range.\nInstructions:\nAnswer the following questions below. For more information check the rating plate/door of the unit, manufacturer’s booklets (physical/online), codebooks, and the CSA modules.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nBrand of appliance: ___________________________\nModel #: _____________________________________\nSerial #: _____________________________________\nWhat type of gas is this appliance set up for? ___________________________\nWhat is the gas supply inlet size? _________1/2”__________________\nWhat is the static gas supply pressure? ____________7” W.C._______________\nWhat is the maximum supply pressure rating? ___________13” W.C.________________\nWhat is the minimum supply pressure rating? ____________6” W.C._______________\nWhat is the manifold pressure? __________5” W.C._________________\nBtu Input: ______55 mBtu_____________________\nInstall a gas hose with a quick connect end to the stove. Once installed, plug in the quick connect fitting to any natural gas outlet that is connected to a gas meter. Soap test all connections. Verify with the instructor when completed. (5 marks)\nInstructor signature: ____________________\nClock the meter on the gas stove.\nWhat is the equation for clocking the meter? ___________________________\nHow long did 3 rotations take? ___________________________\nMeasured btu input: ___________________________\nConduct a combustion analysis on the oven and staple the results to the front sheet. Make sure stovetop is cool prior to testing.\nWhat is the efficiency of the unit: _______~24% for oven, ____________________\nWhat Category is it? _______Cat 1____________________\nWhat is the maximum length of gas connector? _________6 ft__________________\nWhat primary voltage does this appliance utilize? ____________120 V_______________\nWhat type of ignition(s) does this appliance utilize? _______Piezo and HSI ______________\nWhat are some safety controls that this appliance utilizes? (2 marks)\nNo stove safeties, oven safety valve, circuit breaker/fuses, self-cleaning door lock, ______________________________________________________________________________________________________________________________________________________\nWhat other parts does this appliance utilize (electric & non-electric): (4 marks)\nHSI, piezo ignitor, control board, thermostat, regulator, burners, timers\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nDisconnect the stove from the quick connect fitting and shut off the supply valve. Carefully remove the gas hose from the back of the unit without damaging the pipe threads. Verify with the instructor when complete. Leave the unit out to cool before storing it again.          (5 marks)\nInstructor signature: ____________________\nWhat sort of ventilation is required for this stove? Clause #? (2 marks)\nRange hood exhausting to the outside. ___________________________________________\nWhat is the anti-tip bracket? How is it installed and how does it work? (3 marks)\n_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhere in the code book does it refer to this type of appliance? List sections and code reference numbers. (3 marks)\n7.9, 7.33, 4.13.2, 8.23 _________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat clearances does this type of appliance have to adhere to? List code references and the clearances, and manufacturers specs. (4 marks)\nAbove: 30”, Sides: 0” if below cooktop, Back: 1”, Front:24”\n_____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat is the sequence of operation for this appliance? (5 marks)\n___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________",
          "content_truncated": false
        },
        {
          "filename": "Lab #1 - Gas Range.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Lab Practicals",
          "char_count": 5788,
          "content": "Gas Range Practical\nLearning Outcome:\nUpon completion of this shop project, you will understand the electrical and gas connections, sequence of operation, components, and general usage of a gas range.\nInstructions:\nAnswer the following questions below. For more information check the rating plate/door of the unit, manufacturer’s booklets (physical/online), codebooks, and the CSA modules.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nBrand of appliance: ___________________________\nModel #: _____________________________________\nSerial #: _____________________________________\nWhat type of gas is this appliance set up for? ___________________________\nWhat is the gas supply inlet size? ___________________________\nWhat is the static gas supply pressure? ___________________________\nWhat is the maximum supply pressure rating? ___________________________\nWhat is the minimum supply pressure rating? ___________________________\nWhat is the manifold pressure? ___________________________\nBtu Input: ___________________________\nInstall a gas hose with a quick connect end to the stove. Once installed, plug in the quick connect fitting to any natural gas outlet that is connected to a gas meter. Soap test all connections. Verify with the instructor when completed. (5 marks)\nInstructor signature: ____________________\nClock the meter on the gas stove.\nWhat is the equation for clocking the meter? ___________________________\nHow long did 3 rotations take? ___________________________\nMeasured btu input: ___________________________\nConduct a combustion analysis on the oven and staple the results to the front sheet. Make sure stovetop is cool prior to testing.\nWhat is the efficiency of the unit: ___________________________\nWhat Category is it? ___________________________\nWhat is the maximum length of gas connector? ___________________________\nWhat primary voltage does this appliance utilize? ___________________________\nWhat type of ignition(s) does this appliance utilize? ___________________________\nWhat are some safety controls that this appliance utilizes? (2 marks) _________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat other parts does this appliance utilize (electric & non-electric): (4 marks) ____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nDisconnect the stove from the quick connect fitting and shut off the supply valve. Carefully remove the gas hose from the back of the unit without damaging the pipe threads. Verify with the instructor when complete. Leave the unit out to cool before storing it again.          (5 marks)\nInstructor signature: ____________________\nWhat sort of ventilation is required for this stove? Clause #? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat is the anti-tip bracket? How is it installed and how does it work? (3 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhere in the code book does it refer to this type of appliance? List sections and code reference numbers. (2 marks) ______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat clearances does this type of appliance have to adhere to? List code references and the clearances, and manufacturers specs. (5 marks)\n________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat is the sequence of operation for this appliance? (5 marks)\n___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________",
          "content_truncated": false
        },
        {
          "filename": "Lab #2 - Gas Dryer - Answers.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Lab Practicals",
          "char_count": 4757,
          "content": "Gas Clothes Dryer Practical\nLearning Outcome:\nUpon completion of this shop project, you will understand the electrical and gas connections, sequence of operation, components, and general usage of a gas dryer.\nInstructions:\nAnswer the following questions below. For more information check the rating plate/door of the unit, manufacturer’s booklets (physical/online), codebooks, and the CSA modules.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nBrand of appliance: ___________________________\nModel #: _____________________________________\nSerial #: _____________________________________\nWhat type of gas is this appliance set up for? ___________________________\nWhat is the gas supply inlet size? _________3/8”__________________\nWhat is the static gas supply pressure? _______7” W.C.____________________\nWhat is the maximum supply pressure rating? _________10.5” W.C.__________________\nWhat is the minimum supply pressure rating? ___________4” ” W.C.________________\nWhat is the manifold pressure? ________3.5” W.C.___________________\nBtu Input: _________22 mBtu__________________\nInstall a gas hose with a quick connect end to the dryer. Once installed, plug in the quick connect fitting to any natural gas outlet that is connected to a gas meter. Soap test all connections. Verify with the instructor when completed. (5 marks)\nInstructor signature: ____________________\nClock the meter on the gas dryer.\nWhat is the equation for clocking the meter? ___________________________\nHow long did 3 rotations take? ___________________________\nMeasured btu input: ___________________________\nWhat primary voltage does this appliance utilize? ________120 V___________\nWhat type of ignition does this appliance utilize? _______HSI______________\nWhat are some safety controls that this appliance utilizes? (3 marks)\nDoor switch, high limit, radiant sensor\n___________________________________________________________________________\nWhat other parts does this appliance utilize (electric & non-electric): (4 marks)\nMotor, burner, drum, belt, rollers, baffles, burner, temperature selector, timer, start button, lint collector, centrifugal switch ___________________________________________________________________________\nDisconnect the dryer from the quick connect fitting and shut off the supply valve. Carefully remove the gas hose from the back of the unit without damaging the pipe threads. Verify with the instructor when complete. (5 marks)\nInstructor signature: ____________________\nWhat is the venting diameter size for this unit? ___________4”________________\nWhat venting type material does this appliance utilize: (2 marks)\nRidgid pipe, flexible metal duct, or certified plastic vent\n___________________________________________________________________________\nHow should the venting be attached? (2 marks)\nGear clamps or tin/duct tape\n___________________________________________________________________________\nHow should the venting never be attached? Why? (2 marks)\n___________________________________________________________________________\nWhere in the code book does it refer to this type of appliance? List sections and code reference numbers. (2 marks)\nSection 7.5: 7.5.1 to 7.5.5,\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat clearances does this type of appliance have to adhere to? List code references and the clearances, and manufacturers specs. (5 marks)\nAbove: 6”, Front: 24”, Sides: 6”, Back: 6” _________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat is the sequence of operation for this appliance? (5 marks)\n__________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nLabel the following parts of the dryer below: (10 marks)\nStart button, temperature selector, timer, door switch, baffles, drum, drum roller, belt, burner, fan/belt motor,",
          "content_truncated": false
        },
        {
          "filename": "Lab #2 - Gas Dryer.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Lab Practicals",
          "char_count": 5244,
          "content": "Gas Clothes Dryer Practical\nLearning Outcome:\nUpon completion of this shop project, you will understand the electrical and gas connections, sequence of operation, components, and general usage of a gas dryer.\nInstructions:\nAnswer the following questions below. For more information check the rating plate/door of the unit, manufacturer’s booklets (physical/online), codebooks, and the CSA modules.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nBrand of appliance: ___________________________\nModel #: _____________________________________\nSerial #: _____________________________________\nWhat type of gas is this appliance set up for? ___________________________\nWhat is the gas supply inlet size? ___________________________\nWhat is the static gas supply pressure? ___________________________\nWhat is the maximum supply pressure rating? ___________________________\nWhat is the minimum supply pressure rating? ___________________________\nWhat is the manifold pressure? ___________________________\nBtu Input: ___________________________\nInstall a gas hose with a quick connect end to the dryer. Once installed, plug in the quick connect fitting to any natural gas outlet that is connected to a gas meter. Soap test all connections. Verify with the instructor when completed. (5 marks)\nInstructor signature: ____________________\nClock the meter on the gas dryer.\nWhat is the equation for clocking the meter? ___________________________\nHow long did 3 rotations take? ___________________________\nMeasured btu input: ___________________________\nWhat primary voltage does this appliance utilize? ___________________________\nWhat type of ignition does this appliance utilize? ___________________________\nWhat are some safety controls that this appliance utilizes? (3 marks) _________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat other parts does this appliance utilize (electric & non-electric): (4 marks) _________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nDisconnect the dryer from the quick connect fitting and shut off the supply valve. Carefully remove the gas hose from the back of the unit without damaging the pipe threads. Verify with the instructor when complete. (5 marks)\nInstructor signature: ____________________\nWhat is the venting diameter size for this unit? ___________________________\nWhat venting type material does this appliance utilize: (2 marks) _________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nHow should the venting be attached? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nHow should the venting never be attached? Why? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhere in the code book does it refer to this type of appliance? List sections and code reference numbers. (2 marks)\n______________________________________________________________________________________________________________________________________________________\nWhat clearances does this type of appliance have to adhere to? List code references and the clearances, and manufacturers specs. (5 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat is the sequence of operation for this appliance? (5 marks)\n___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nLabel the following parts of the dryer below: (10 marks)",
          "content_truncated": false
        },
        {
          "filename": "Lab #5 - Gas Lamp.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 15 - Domestic Appliances\\Lab Practicals",
          "char_count": 6280,
          "content": "Gas Lamp Installation Project\nLearning Outcome:\nUpon completion of this shop project, you will research, layout, and describe the installation and upkeep of a gas lamp.\nInstructions:\nVisit https://americangaslamp.com/ and https://bevolo.com/ to look at some of the different styles of gas lamps that are available. You will be doing a mock install of your own house with exterior lamps only.\nWhat company did you choose? ____________________\nWhat style mount did you choose? Wall mount / Ceiling mount / Post mount\nIf post installation, what style did you choose? ____________________\nWhat style of gas lamp did choose? ____________________\nWhat are the clearances for the lamp? (2 marks) ______________________________________________________________________________________________________________________________________________________\nDid you choose mantle or open flame design? ____________________\nHow can the lamp be lit? ______________________________________________________\nWhat size gas line runs internally in the lamp? ____________________\nWhat type of gas is available at your home? ____________________\nWhat gas pressure is rated for your lamp? ____________________\nWhat is the maximum gas pressure rated for your lamp? ____________________\nWhat is the minimum gas pressure rated for your lamp? ____________________\nWhat is the Btu rating of your lamp? ____________________\nCan the lamp be installed on your current gas line? Does the supply line to the lamp need to be resized due to distance or any other factors? Prove it using code tables from B149.1.      (5 marks)\n_____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat is the finalized size of gas line that will supply the lamp? ________________________\nWhat type and size of connector is used to connect the supply and lamp? (2 marks) ______________________________________________________________________________________________________________________________________________________\nShow an isometric sketch of the current gas line in your house. Include the meter to all current appliances installed. List the size and length of all gas lines. Each appliance should also be labeled. (10 marks)\nShow an isometric sketch for how you would run the new gas line up to the lamp, internal to the house. Show connections from the current system to where the lamp will be located. (5 marks)\nShow a sketch of the area that the lamp is going to be installed in, external to the house. Include how the gas line will be ran to the lamp, and any measurements and clearances that the manufacturer and codes follow. Multiple sketches may be shown if the area is difficult to convey in one single image. (10 marks)\nMake a list of materials you would need to run this new gas line. List all parts (black iron & copper) with corresponding sizes. (10 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat are the installation instructions once the gas has been run? Include post installation if using one. (15 marks)\n________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat are the lighting instructions for the lamp? (5 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________",
          "content_truncated": false
        }
      ],
      "total_documents": 19,
      "total_chars": 276272,
      "edition": "7th Edition",
      "is_primary": false
    }
  }
}