{
  "unit_name": "Unit 24 - Air Handling",
  "unit_number": 24,
  "category": "G2",
  "editions": {
    "7th": {
      "category": "G2",
      "total_documents": 12,
      "total_chars": 233303,
      "documents": [
        {
          "filename": "CSA Unit 24 - Air Handling - Final.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 24 - Air Handling",
          "char_count": 92495,
          "content": "CSA Unit 24 - Air Handling\nChapter 1                                           \nAir Handling for Gas \nTechnicians\nSince air movement has a significant impact on building comfort and \nsafety, the gas technician/fitter must understand air handling. Gas \ntechnicians/fitters should be familiar with the building and gas codes, \nprovincial regulations, and industry standards that govern air handling. In \naddition, they should have a good understanding of the effect of the \nbuilding as a system on air movement, the process of heat transfer, and \nthe qualities and characteristics of air.\nMK by Mike Kapin\nCreated\nCopywrite 2025\nLearning Objectives\nIdentify Codes and Standards\nIdentify codes and industry standards that apply to air flow\nUnderstand Heat Transfer\nDescribe the process of heat transfer and heating equipment \ncapacity\nAir Properties\nDescribe the properties and characteristics of air\nService Procedures\nDescribe service and adjustment procedures for air handling units\nKey Terminology\nAbbreviation (Symbol)\nDefinition\nH\nThe total heat contained in a \nsubstance, which is the sum of sensible \nheat and latent heat\nThe process of heat moving from one \nsource to another\nMoisture in the air that comes from \nwater that has evaporated into the air\n>\nThe volume of a substance per unit of \nthe substance\nThe intensity of heat, measured with a \ndry bulb thermometer\nV\nThe amount of space that a three-\ndimensional figure occupies\nGas Trade Training and Red Seal Alignment\nYou can use the CSA Group Gas Trade Training materials as resources to help you prepare for the Red Seal Gasfitter – Class B \nexam. For more information on how these materials align with the 2014 national standard for the occupation of Gasfitter - \nClass B, please review an expanded reference matrix at https://store.csagroup.org/.\nCodes and Industry Standards\nThe gas technician/fitter must be familiar with the requirements contained in CSA B149.1 as well as the appropriate provincial \nbuilding codes and industry standards. CSA Group publishes two standards directly relevant to air handling equipment:\nCAN/CSA F280\nStandard for determining the required capacity of \nresidential space heating and cooling appliances\nCAN/CSA F326\nStandard for residential mechanical ventilation \nsystems\nHRAI and Industry Support\nThe Heating, Refrigeration and Air Conditioning Institute of Canada \n(HRAI) provides certification courses and technical manuals that address \nthe requirements of building codes and industry standards for residential \nand small commercial heating, ventilating, and air conditioning systems, \nas they apply to selection and installation of these systems.\nIn addition to knowing building code requirements, the gas \ntechnician/fitter must consult with municipal building departments for \nlocal bylaws pertaining to heating and ventilation.\nRelevant Codes and Standards\nNational Building Code of Canada (NBC)\nNational Building Code that forms the basis for codes written in \nCanadian provinces\nNational Research Council Canada (NRC): www.nrc-cnrc.gc.ca\nOntario Building Code (OBC)\nBuilding code used in Ontario\nContains some additional requirements beyond CAN/CSA F326\nOntario Ministry of Municipal Affairs and Housing: \nwww.mah.gov.on.ca\nBritish Columbia Building Code (BCBC)\nBuilding code used in British Columbia that contains some \nprescriptive requirements different from those of the NBC and \nCAN/CSA F326 (however, CAN/CSA F326 is permitted as an \nalternative.)\nBritish Columbia Codes: www.bccodes.ca\nR-2000 Standard\nAn industry-endorsed technical performance standard for energy \nefficiency, indoor air tightness quality, and environmental \nresponsibility in home construction\nTechnical requirements comply with CAN/CSA F326, but include \nadditional requirements for energy performance, qualifications of \nthe installer and designer, and record-keeping\nA voluntary standard administered by Natural Resources Canada \n(NRCan): www.nrcan.gc.ca/home\nNational Building Code of Canada (NBC)\nTwo sections of the NBC contain clauses that apply to air handlers:\nPart 6\n•\nHeating, Ventilating and Air-Conditioning\n•\nCovers technical requirements\n•\nApplies to all buildings\nPart 9\n•\nHousing and Small Buildings\n•\nCovers prescriptive requirements\n•\nApplies to buildings of three or fewer stories and with a \nbuilding area not exceeding 600 m²\nNBC Application Areas\nBesides general clauses dealing with scope, application, definitions, and plans and \nspecifications, Parts 6 and 9 apply to design and installation of:\nVentilation\nRequirements for fresh air and exhaust systems\nAir Duct Systems\nGeneral requirements for all ductwork\nLow Capacity Systems\nSpecific requirements for residential and small commercial applications\nHeating Appliances\nRequirements for various heating equipment types\nThe Heating, Refrigeration and Air Conditioning \nInstitute of Canada (HRAI)\nHRAI (www.hrai.ca/) is a national non-profit trade association of heating, ventilation, air conditioning and refrigeration (HVACR) \nmanufacturers, wholesalers, and contractors.\nHRAI works with government departments at the local, provincial, and national levels to ensure that regulations reflect the expertise \nand concerns of those involved in the industry. The organization also provides training for the industry by conducting certification \ncourses and publishing technical manuals.\nNote: These courses do not authorize gas fitters/technicians to work on systems that exceed their local license based on the different \nexisting trade regulations in various provinces but to offer additional avenues of training and awareness.\nHRAI Ductwork Requirements\nAll ducting (except for bathroom fan ducts) must meet the requirements detailed in Part 6 \nof the NBC. HRAI refers to four practical implications of Part 6 on ductwork:\nNoncombustible \nMaterials\nDucts must be made of \nnoncombustible materials\nFlexible Duct \nStandards\nAll flexible ducts must meet \nUL 181 Class 1 duct \nrequirements\nProper Mounting\nDucts must be properly \nsecured and mounted\nGood Engineering\nThe design of ducting must \nbe in accordance with good \nengineering practices\nHeat Transfer, Ventilation, and Air Handlers\nAir handlers are a key component of heating, cooling, and ventilation systems. A review of some of the key principles of heat \ntransfer, heat loss/gain calculations, and ventilation requirements is necessary for a full appreciation of the role of air handlers. \nCSA Group Gas Trade Training especially Unit 14 The building as a system - covers most of these key principles.\nHeat Transfer Fundamentals\nHeat transfer is the process of heat moving from one source to another. \nThe amount of heat contained in an object or substance depends upon \nits:\nTemperature\nThe measure of thermal \nenergy intensity\nWeight\nThe mass of the substance\nSpecific Heat\nThe amount of heat required to raise the temperature of a unit \nweight of a substance one degree\nHeat Transfer Terminology\nSensible Heat\nHeat that changes the temperature of a substance without changing its state.\nLatent Heat\nHeat required to change the state of a substance without changing its \ntemperature.\nTotal Heat (Enthalpy)\nSum of all the sensible heat and latent heat contained in a substance.\nSpecific Heat\nAmount of heat required to raise the temperature of a unit weight of a \nsubstance one degree.\nSpecific Heat Measurements\nImperial Units\nIn imperial units, the measurement is in British Thermal \nUnits (Btu). A Btu is the amount of heat required to change \nthe temperature of one pound of water one degree \nFahrenheit (1ºF).\nThe specific heat of water is 1 Btu in imperial units. It takes \none Btu to raise one pound of water 1°F.\nThe specific heat of air varies slightly with temperature. At \nstandard temperature, the specific heat is 0.2417 Btu/lb.\nMetric Units\nThe calorie is the metric measurement used in the same way \nas the Btu. One calorie is equal to the amount of heat \nrequired to raise the temperature of one gram of water one \ndegree Celsius.\nA more commonly referenced metric unit of energy is the \njoule. One calorie is equal to 4.186 joules (J). Since it takes 1 \nkilocalorie to raise the temperature of one kilogram of water \n1 °C, 4.186 kilojoules (kJ) will raise the temperature of one \nkilogram of water 1 °C.\nIn metric units, the specific heat of air is 1.01 kJ/kg.\nDesign Temperature \nConsiderations\nIndoor Design Temperature (IDT)\nThe temperature selected for the inside of the building — usually 72°F (22 °C) \nfor buildings occupied by people.\nOutdoor Design Temperature (ODT)\nThe expected outdoor temperature that a heating or cooling load must \nbalance.\nThis temperature is based on a 10-year average for a specific location.\nFor heat loss calculations, it represents the lowest sustained temperature \nthat might be expected during normal winter conditions.\nFor heat gain calculations, it is the highest sustained temperature that might \nbe expected during normal summer conditions.\nHeat Loss/Gain Calculation \nFactors\nVariables\nData that relates to the location and specifications of a building.\nFactors\nNumerical values that represent the heat produced or transferred under a \nspecific condition.\nExposed Surfaces\nBuilding surfaces exposed to outdoor temperatures. These are calculated \nusing the building dimensions. The area of each wall, roof, or other \nexposed surface is calculated separately.\nExposure\nThe direction a wall faces in relation to the elements.\nSolar Gain and Wall Area Calculations\nSolar Gain\nBuilding heat gain associated with radiant heat from the sun. \nSolar gain on a surface depends on the exposure of the \nexterior walls, windows, and doors. Factors for solar gain are \nincluded in calculations of heating and cooling loads, \naccording to different exposures of each flat surface to the \nsun.\nThe area of each flat surface is found by multiplying the \nlength of the surface by the height.\nWall Area Calculations\nGross Wall Area: Total area of a wall, including windows, \ndoors, and other openings. Gross wall area is calculated \nsepar",
          "content_truncated": true
        },
        {
          "filename": "CSA Unit 24 - Air Handling - Final.pptx",
          "file_type": "powerpoint",
          "relative_path": "CSA Units\\Unit 24 - Air Handling",
          "char_count": 91180,
          "content": "CSA Unit 24 - Air Handling\nChapter 1                                           Air Handling for Gas Technicians\nSince air movement has a significant impact on building comfort and safety, the gas technician/fitter must understand air handling. Gas technicians/fitters should be familiar with the building and gas codes, provincial regulations, and industry standards that govern air handling. In addition, they should have a good understanding of the effect of the building as a system on air movement, the process of heat transfer, and the qualities and characteristics of air.\nMK\nby Mike Kapin\nCreated\nCopywrite 2025\nLearning Objectives\nIdentify Codes and Standards\nIdentify codes and industry standards that apply to air flow\nUnderstand Heat Transfer\nDescribe the process of heat transfer and heating equipment capacity\nAir Properties\nDescribe the properties and characteristics of air\nService Procedures\nDescribe service and adjustment procedures for air handling units\nKey Terminology\nAbbreviation (Symbol)\nDefinition\nH\nThe total heat contained in a substance, which is the sum of sensible heat and latent heat\nThe process of heat moving from one source to another\nMoisture in the air that comes from water that has evaporated into the air\n>\nThe volume of a substance per unit of the substance\nThe intensity of heat, measured with a dry bulb thermometer\nV\nThe amount of space that a three-dimensional figure occupies\nGas Trade Training and Red Seal Alignment\nYou can use the CSA Group Gas Trade Training materials as resources to help you prepare for the Red Seal Gasfitter – Class B exam. For more information on how these materials align with the 2014 national standard for the occupation of Gasfitter - Class B, please review an expanded reference matrix at https://store.csagroup.org/.\nCodes and Industry Standards\nThe gas technician/fitter must be familiar with the requirements contained in CSA B149.1 as well as the appropriate provincial building codes and industry standards. CSA Group publishes two standards directly relevant to air handling equipment:\nCAN/CSA F280\nStandard for determining the required capacity of residential space heating and cooling appliances\nCAN/CSA F326\nStandard for residential mechanical ventilation systems\nHRAI and Industry Support\nThe Heating, Refrigeration and Air Conditioning Institute of Canada (HRAI) provides certification courses and technical manuals that address the requirements of building codes and industry standards for residential and small commercial heating, ventilating, and air conditioning systems, as they apply to selection and installation of these systems.\nIn addition to knowing building code requirements, the gas technician/fitter must consult with municipal building departments for local bylaws pertaining to heating and ventilation.\nRelevant Codes and Standards\nNational Building Code of Canada (NBC)\nNational Building Code that forms the basis for codes written in Canadian provinces\nNational Research Council Canada (NRC): www.nrc-cnrc.gc.ca\nOntario Building Code (OBC)\nBuilding code used in Ontario\nContains some additional requirements beyond CAN/CSA F326\nOntario Ministry of Municipal Affairs and Housing: www.mah.gov.on.ca\nBritish Columbia Building Code (BCBC)\nBuilding code used in British Columbia that contains some prescriptive requirements different from those of the NBC and CAN/CSA F326 (however, CAN/CSA F326 is permitted as an alternative.)\nBritish Columbia Codes: www.bccodes.ca\nR-2000 Standard\nAn industry-endorsed technical performance standard for energy efficiency, indoor air tightness quality, and environmental responsibility in home construction\nTechnical requirements comply with CAN/CSA F326, but include additional requirements for energy performance, qualifications of the installer and designer, and record-keeping\nA voluntary standard administered by Natural Resources Canada (NRCan): www.nrcan.gc.ca/home\nNational Building Code of Canada (NBC)\nTwo sections of the NBC contain clauses that apply to air handlers:\nPart 6\nHeating, Ventilating and Air-Conditioning\nCovers technical requirements\nApplies to all buildings\nPart 9\nHousing and Small Buildings\nCovers prescriptive requirements\nApplies to buildings of three or fewer stories and with a building area not exceeding 600 m²\nNBC Application Areas\nBesides general clauses dealing with scope, application, definitions, and plans and specifications, Parts 6 and 9 apply to design and installation of:\nVentilation\nRequirements for fresh air and exhaust systems\nAir Duct Systems\nGeneral requirements for all ductwork\nLow Capacity Systems\nSpecific requirements for residential and small commercial applications\nHeating Appliances\nRequirements for various heating equipment types\nThe Heating, Refrigeration and Air Conditioning Institute of Canada (HRAI)\nHRAI (www.hrai.ca/) is a national non-profit trade association of heating, ventilation, air conditioning and refrigeration (HVACR) manufacturers, wholesalers, and contractors.\nHRAI works with government departments at the local, provincial, and national levels to ensure that regulations reflect the expertise and concerns of those involved in the industry. The organization also provides training for the industry by conducting certification courses and publishing technical manuals.\nNote: These courses do not authorize gas fitters/technicians to work on systems that exceed their local license based on the different existing trade regulations in various provinces but to offer additional avenues of training and awareness.\nHRAI Ductwork Requirements\nAll ducting (except for bathroom fan ducts) must meet the requirements detailed in Part 6 of the NBC. HRAI refers to four practical implications of Part 6 on ductwork:\nNoncombustible Materials\nDucts must be made of noncombustible materials\nFlexible Duct Standards\nAll flexible ducts must meet UL 181 Class 1 duct requirements\nProper Mounting\nDucts must be properly secured and mounted\nGood Engineering\nThe design of ducting must be in accordance with good engineering practices\nHeat Transfer, Ventilation, and Air Handlers\nAir handlers are a key component of heating, cooling, and ventilation systems. A review of some of the key principles of heat transfer, heat loss/gain calculations, and ventilation requirements is necessary for a full appreciation of the role of air handlers. CSA Group Gas Trade Training especially Unit 14 The building as a system - covers most of these key principles.\nHeat Transfer Fundamentals\nHeat transfer is the process of heat moving from one source to another. The amount of heat contained in an object or substance depends upon its:\nTemperature\nThe measure of thermal energy intensity\nWeight\nThe mass of the substance\nSpecific Heat\nThe amount of heat required to raise the temperature of a unit weight of a substance one degree\nHeat Transfer Terminology\nSensible Heat\nHeat that changes the temperature of a substance without changing its state.\nLatent Heat\nHeat required to change the state of a substance without changing its temperature.\nTotal Heat (Enthalpy)\nSum of all the sensible heat and latent heat contained in a substance.\nSpecific Heat\nAmount of heat required to raise the temperature of a unit weight of a substance one degree.\nSpecific Heat Measurements\nImperial Units\nIn imperial units, the measurement is in British Thermal Units (Btu). A Btu is the amount of heat required to change the temperature of one pound of water one degree Fahrenheit (1ºF).\nThe specific heat of water is 1 Btu in imperial units. It takes one Btu to raise one pound of water 1°F.\nThe specific heat of air varies slightly with temperature. At standard temperature, the specific heat is 0.2417 Btu/lb.\nMetric Units\nThe calorie is the metric measurement used in the same way as the Btu. One calorie is equal to the amount of heat required to raise the temperature of one gram of water one degree Celsius.\nA more commonly referenced metric unit of energy is the joule. One calorie is equal to 4.186 joules (J). Since it takes 1 kilocalorie to raise the temperature of one kilogram of water 1 °C, 4.186 kilojoules (kJ) will raise the temperature of one kilogram of water 1 °C.\nIn metric units, the specific heat of air is 1.01 kJ/kg.\nDesign Temperature Considerations\nIndoor Design Temperature (IDT)\nThe temperature selected for the inside of the building — usually 72°F (22 °C) for buildings occupied by people.\nOutdoor Design Temperature (ODT)\nThe expected outdoor temperature that a heating or cooling load must balance.\nThis temperature is based on a 10-year average for a specific location.\nFor heat loss calculations, it represents the lowest sustained temperature that might be expected during normal winter conditions.\nFor heat gain calculations, it is the highest sustained temperature that might be expected during normal summer conditions.\nHeat Loss/Gain Calculation Factors\nVariables\nData that relates to the location and specifications of a building.\nFactors\nNumerical values that represent the heat produced or transferred under a specific condition.\nExposed Surfaces\nBuilding surfaces exposed to outdoor temperatures. These are calculated using the building dimensions. The area of each wall, roof, or other exposed surface is calculated separately.\nExposure\nThe direction a wall faces in relation to the elements.\nSolar Gain and Wall Area Calculations\nSolar Gain\nBuilding heat gain associated with radiant heat from the sun. Solar gain on a surface depends on the exposure of the exterior walls, windows, and doors. Factors for solar gain are included in calculations of heating and cooling loads, according to different exposures of each flat surface to the sun.\nThe area of each flat surface is found by multiplying the length of the surface by the height.\nWall Area Calculations\nGross Wall Area: Total area of a wall, including windows, doors, and other openings. Gross wall area is calculated separately for each exposed wall of a building.\nNet Wall Area: Area of a wall after the areas of windows, d",
          "content_truncated": true
        },
        {
          "filename": "CSA Unit 24 Air Handling - Question Bank.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 24 - Air Handling",
          "char_count": 18523,
          "content": "CSA Unit 24 Air Handling - 90 Question Multiple Choice Test\nInstructions\nChoose the best answer for each question. Mark your answers clearly.\n1. Which CSA standard determines the required capacity of residential space heating and cooling appliances? A) CSA B149.1 B) CAN/CSA F280 C) CAN/CSA F326 D) CSA F327\n2. What does HRAI stand for? A) Heating, Refrigeration and Air Conditioning Institute of Canada B) Home Renovation and Air Installation Corporation C) Heat Recovery and Air Intelligence D) Housing Retrofit Air Integration\n3. According to the NBC, Part 6 covers which requirements? A) Prescriptive requirements for small buildings B) Technical requirements for heating, ventilating and air-conditioning C) Electrical requirements for HVAC systems D) Plumbing requirements for air handlers\n4. What material standard must all flexible ducts meet according to HRAI? A) UL 181 Class 2 B) UL 181 Class 1 C) CSA Class A D) NBC Class 3\n5. Heat transfer is defined as: A) The temperature of a substance B) The process of heat moving from one source to another C) The weight of heated air D) The volume of air in a system\n6. What is sensible heat? A) Heat that changes the state of a substance without changing temperature B) Heat that changes temperature without changing the state C) The total heat in a substance D) Heat required to vaporize water\n7. In imperial units, what is the specific heat of air at standard temperature? A) 1.0 Btu/lb B) 0.2417 Btu/lb C) 0.5 Btu/lb D) 1.08 Btu/lb\n8. What is the typical indoor design temperature for buildings occupied by people? A) 68°F (20°C) B) 70°F (21°C) C) 72°F (22°C) D) 75°F (24°C)\n9. Which method of heat transfer occurs when heat flows through a material from the warmer side to the cooler side? A) Convection B) Radiation C) Conduction D) Evaporation\n10. What is the primary function of a space-heating appliance according to the text? A) To create positive building pressure B) To replace heat lost by the building C) To circulate air throughout the building D) To filter indoor air\n11. Which ventilation system creates negative pressure in a building? A) Supply fan systems B) Balanced systems C) Exhaust fan systems D) Integrated systems\n12. What problem can occur with supply fan ventilation systems in winter? A) Back-drafting of appliances B) Cold air blowing directly on occupants C) Excessive negative pressure D) Reduced air quality\n13. What type of distribution system uses the forced-air heating system to distribute ventilation air? A) Dedicated distribution B) Through-the-wall distribution C) Integrated distribution D) Independent distribution\n14. What is relative humidity? A) The actual amount of moisture in air B) The temperature at which moisture condenses C) The amount of moisture in air compared to maximum capacity at the same temperature D) The weight of water vapor per pound of dry air\n15. At what condition do dry bulb and wet bulb temperatures become equal? A) At maximum humidity B) At dew point (saturation) C) At standard conditions D) At zero humidity\n16. What is enthalpy? A) The temperature of air B) The moisture content of air C) The total heat contained in a substance D) The volume of air per unit weight\n17. At standard conditions, what is the volume of one pound of dry air? A) 12.5 ft³ B) 13.33 ft³ C) 14.7 ft³ D) 15.2 ft³\n18. For residential applications requiring 1.5 air changes per hour, what is the imperial calculation formula? A) cfm = Volume × 1.5 × 60 B) cfm = Volume × 1.5 ÷ 60 C) cfm = Volume ÷ 1.5 × 60 D) cfm = Volume × 60 ÷ 1.5\n19. What is the typical minimum airflow rate for a 2-bedroom home under 140 m² according to the building code table? A) 14 L/s B) 21 L/s C) 28 L/s D) 35 L/s\n20. Which type of blower blade is most common in residential applications? A) Backward-curved B) Forward-curved C) Airfoil D) Straight\n21. What does ECM stand for? A) Electric Control Motor B) Electronically Commutated Motor C) Energy Conservation Motor D) Electronic Current Motor\n22. Which motor type provides variable speed capability with high efficiency? A) PSC motor B) Shaded pole motor C) ECM motor D) Split-phase motor\n23. What should be done with filters according to maintenance requirements? A) Clean monthly, replace annually B) Replace according to manufacturer specifications and usage C) Clean only when visibly dirty D) Replace every six months regardless of condition\n24. What tool measures air velocity at supply registers? A) Manometer B) Anemometer C) Flow hood D) Pitot tube\n25. What is the most common cause of inefficient heating and cooling system operation? A) Undersized ductwork B) Improper damper position C) Dirty air filtration devices D) Blocked cooling coils\n26. In an extended plenum system, what are the small ducts called that deliver air to rooms? A) Trunk ducts B) Branch ducts C) Return ducts D) Supply ducts\n27. What happens to trunk duct size in a reducing plenum system? A) Stays the same throughout B) Gets larger as branches are added C) Gets smaller as branches are added D) Alternates between large and small sections\n28. Which return air system is more expensive but provides the most positive return? A) Central return B) Individual return C) Perimeter return D) Radial return\n29. What is a take-off in duct systems? A) A transition piece B) A fitting that draws air from a plenum into another duct C) A damper control device D) An outlet grille\n30. What should be installed to ensure gradual changes in duct volume? A) Take-offs B) Dampers C) Transition fittings D) Drive cleats\n31. What is the purpose of dampers in duct systems? A) To connect different sized ducts B) To control the flow of air C) To reduce noise D) To prevent heat loss\n32. Which side of duct liner should face the air stream? A) White side B) Silver side C) Black side D) Either side\n33. What is the primary purpose of flexible duct connectors? A) To connect different sized ducts B) To allow for thermal expansion C) To reduce noise transmission D) To improve air flow\n34. Where should air filtration devices be located in relation to humidifiers? A) Downstream from humidifiers B) Upstream from humidifiers C) Parallel to humidifiers D) It doesn't matter\n35. What is gauge pressure? A) Pressure above perfect vacuum B) Pressure at standard conditions C) Amount by which pressure exceeds ambient atmospheric pressure D) Pressure measured in mercury\n36. For very small pressure changes in forced-air systems, measurements are typically expressed in: A) Pounds per square inch (psi) B) Inches of water column (w.c.) C) Kilopascals (kPa) D) Millimeters of mercury\n37. What is the typical airflow requirement per ton of cooling? A) 300 cfm B) 400 cfm C) 500 cfm D) 600 cfm\n38. In the air flow calculation formula V = Q/A, what does 'A' represent? A) Air velocity B) Air flow rate C) Area of duct D) Atmospheric pressure\n39. What is static pressure? A) Air pressure parallel to air flow direction B) Air pressure perpendicular to air flow direction C) Total pressure minus velocity pressure D) Pressure created by air weight\n40. How is velocity pressure calculated? A) Static pressure + Total pressure B) Total pressure - Static pressure C) Static pressure × 2 D) Total pressure ÷ Static pressure\n41. What device uses two concentric tubes to measure velocity pressure? A) Manometer B) Anemometer C) Pitot tube D) Flow hood\n42. For accurate pitot tube readings, how far downstream from elbows should measurements be taken? A) 5 duct diameters B) 10 duct diameters C) 15 duct diameters D) 20 duct diameters\n43. In the air velocity formula V = 4005 × √Pv, what does the constant 4005 represent? A) Conversion factor for imperial units B) Standard atmospheric pressure C) Air density at standard conditions D) Gravitational constant\n44. What is the typical maximum external static pressure for furnace operation? A) 0.25 inch w.c. B) 0.50 inch w.c. C) 0.75 inch w.c. D) 1.00 inch w.c.\n45. In the static pressure drop formula TPD = (L/100) × DPD, what does 'L' represent? A) Length of duct section in feet B) Load factor C) Loss coefficient D) Linear velocity\n46. When sizing a blower, what must be calculated to determine total static pressure drop? A) Only supply side pressure drop B) Only return side pressure drop C) Supply and return side pressure drops added together D) Average of supply and return pressure drops\n47. What size drill bit is used for static pressure test holes? A) 1/4 inch B) 5/16 inch C) 3/8 inch D) 1/2 inch\n48. If supply static pressure is 0.26 inch w.c. and return static pressure is 0.21 inch w.c., what is the TESP? A) 0.05 inch w.c. B) 0.47 inch w.c. C) 0.235 inch w.c. D) 0.52 inch w.c.\n49. In the heating air flow formula AF = OR / (1.08 × TR), what does the constant 1.08 represent? A) Standard air density B) Heat capacity factor C) Conversion constant D) Efficiency factor\n50. How long should a furnace run to reach steady-state efficiency for temperature rise measurement? A) 5 minutes B) 10 minutes C) 15 minutes D) 20 minutes\n51. If temperature rise is higher than specified, what adjustment should be made? A) Decrease blower speed B) Increase blower speed C) Adjust gas pressure D) Change burner orifices\n52. What can significantly impact fan performance besides motor condition? A) Ambient temperature only B) Voltage, cleanliness, and duct configuration C) Only electrical connections D) Time of day operation\n53. What is the most common cause of reduced air flow in HVAC systems? A) Worn motors B) Dirty filters C) Loose belts D) Misaligned pulleys\n54. Gas-fired duct furnaces are designed for use with: A) Built-in air handlers only B) Separate air handling devices C) Natural draft venting only D) Residential applications only\n55. Where are indoor duct furnaces typically installed? A) In basements B) Suspended from main roof beams C) On exterior walls D) In utility rooms\n56. What type of venting uses a fan to force combustion gases out? A) Natural draft vented B) Power vented C) Direct vented D) Induced draft vented\n57. What mounting option ",
          "content_truncated": true
        },
        {
          "filename": "Module 24 Chapter 1 Questions.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Assignments",
          "char_count": 2177,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n1 \nUnit 24 – Chapter 01: Heat loss/Heat gain \n \n1. Which type of ventilation system can lead to problems with moisture laden air being driven \nonto the wall cavities? \na) Natural ventilation \nb) Balanced ventilation \nc) Supply fan ventilation \nd) Exhaust fan ventilation \n \n2. Which type of ventilation system can cause problems with the venting action of fuel-fired \nappliances, creating combustion product spillage or back-drafting? \na) Natural ventilation \nb) Balanced ventilation \nc) Supply fan ventilation \nd) Exhaust fan ventilation \n \n3. What is enthalpy? \na) Enthalpy is the dew point of a sample of air \nb) Enthalpy is the total heat contained in a substance \nc) Enthalpy is the latent heat contained in a substance \nd) Enthalpy is the sensible heat contained in a substance \n \n4. What is dewpoint? \na) The temperature required to change the state of a substance  \nb) The temperature based on a 10year average for a specific location \nc) The temperature below which moisture in the air begins to condense \nd) The temperature above which moisture in the air begins to condense\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n2 \n5. What is the term that describes the percentage of moisture in the air compared to the \namount it would hold if the air were saturated at the same temperature? \na) Dew point \nb) Humidity ratio \nc) Relative humidity \nd) Wet bulb temperature \n \n6. What is the term that indicates the actual amount of moisture found in the air? \na) Dew point \nb) Humidity ratio \nc) Relative humidity \nd) Wet bulb temperature \n \n7. When the temperature on two sides of a material is different, heat flows from the cooler \nside to the warmer side. \na) True \nb) False \n \n8. What is the specific heat of air at standard conditions? \na) 0.018 Btu/lb \nb) 0.2417 Btu/lb \nc) 1.01 Btu/lb \nd) 4.186 Btu/lb \n \n9. What is the danger of having too little ventilation in a dwelling? \na) Increased costs \nb) Cool and Drafty \nc) Positive building pressures \nd) A buildup of pollutants within the dwelling",
          "content_truncated": false
        },
        {
          "filename": "Module 24 Chapter 2 Questions.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Assignments",
          "char_count": 4130,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n1 \nUnit 24 – Chapter 02: Air handling units \n \n1. What is the proper position of a gas fired duct furnace? \na) Upstream of air conditioning coil and air handling fan \nb) Downstream of air conditioning coil and air handling fan \nc) Upstream of air conditioning coil and downstream of air handling fan \nd) Downstream of air conditioning coil and upstream of air handling fan \n \n2. If multiple separately controlled and sequenced duct furnaces are installed in series within \nthe same duct, the upstream duct furnaces must operate before the downstream duct \nfurnaces. \na) True \nb) False \n \n3. A radial duct system can be used to increase headroom in a basement. \na) True \nb) False \n \n4. On individual return air systems, what is usually done to ensure less resistance to air flow in \nthe return system? \na) Undercut doors \nb) Slightly larger return air ducts \nc) Slightly smaller return air ducts \nd) Include return air grilles in rooms without supply air \n \n5. Paint can make flexible duct connectors rigid and prevent them from absorbing vibration. \na) True \nb) False\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n2 \n6. What would indicate internal blockages may be present with a duct furnace? cycling on and \noff due to the operation of the high temperature limit control or incorrect temperature rise \nacross the heat exchanger. \na) Increased CFM \nb) Decreased temperature rise \nc) Increase motor current draw \nd) Cycling on and off on high limit \n \n7. If the blower in a forced-air distribution system moves 2100 cfm of air through a 24 inch x \n18 inch duct? \na) 58 ft/min \nb) 420 ft/min \nc) 700 ft/min \nd) 1000 ft/min \n \n8. Select the statement that best defines velocity pressure. \na) Decrease in air pressure caused by friction \nb) Pressure that is created by the air movement  \nc) Pressure against which the blower has to work \nd) Air pressure in the duct at right angles to the direction of air flow \n \n9. Where is the lowest air pressure in the ductwork of a forced air heating system? \na) On the supply side after the cooling coil \nb) On the return side upstream of the filter \nc) On the return side between the furnace and the filter \nd) On the supply side between the furnace and the cooling coil \n \n10. If the flanges are closed on an adjustable motor pulley, what happens to the belt and pulley? \na) Belt is raised and pulley diameter gets larger \nb) Belt is raised and pulley diameter gets smaller \nc) Belt is lowered and pulley diameter gets larger \nd) Belt is lowered and pulley diameter gets smaller\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n3 \n11. If the motor pulley is increased to twice the original size, what would the blower speed be \n(in relation to the original blower speed)? \na) No change in blower speed \nb) ½ the original blower speed \nc) Twice the original blower speed \nd) Four times the original blower speed \n \n12. If a larger diameter blower pulley is installed, what will happen to air flow and to \ntemperature rise across the heat exchanger? \na) Air flow would increase and temperature rise would decrease \nb) Air flow would decrease and temperature rise would increase \nc) Air flow would increase and temperature rise would increase \nd) Air flow would decrease and temperature rise would decrease \n \n13. If the fan compartment door on a forced air furnace is left off, what is the effect the blower \nmotor? \na) Less work done by motor so current decreases \nb) Less work done by motor so current increases  \nc) More work done by motor so current increases  \nd) More work done by motor so current decreases \n \n14. A PSC motor with multiple windings gets lower efficiency at lower speeds \na) True \nb) False \n \n15. An ECM maintains an efficiency range between 60% and 80%for all speeds \na) True \nb) False \n \n16. Calculate the air velocity for a velocity pressure reading of 0.04 inches of w.c. \na) 566 ft/min \nb) 801 ft/min \nc) 1132 ft/min \nd) 1602 ft/min",
          "content_truncated": false
        },
        {
          "filename": "Module 24 Chapter 1 Answer key.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Assignments\\Answer Keys 2021",
          "char_count": 2177,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n1 \nUnit 24 – Chapter 01: Heat loss/Heat gain \n \n1. Which type of ventilation system can lead to problems with moisture laden air being driven \nonto the wall cavities? \na) Natural ventilation \nb) Balanced ventilation \nc) Supply fan ventilation \nd) Exhaust fan ventilation \n \n2. Which type of ventilation system can cause problems with the venting action of fuel-fired \nappliances, creating combustion product spillage or back-drafting? \na) Natural ventilation \nb) Balanced ventilation \nc) Supply fan ventilation \nd) Exhaust fan ventilation \n \n3. What is enthalpy? \na) Enthalpy is the dew point of a sample of air \nb) Enthalpy is the total heat contained in a substance \nc) Enthalpy is the latent heat contained in a substance \nd) Enthalpy is the sensible heat contained in a substance \n \n4. What is dewpoint? \na) The temperature required to change the state of a substance  \nb) The temperature based on a 10year average for a specific location \nc) The temperature below which moisture in the air begins to condense \nd) The temperature above which moisture in the air begins to condense\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n2 \n5. What is the term that describes the percentage of moisture in the air compared to the \namount it would hold if the air were saturated at the same temperature? \na) Dew point \nb) Humidity ratio \nc) Relative humidity \nd) Wet bulb temperature \n \n6. What is the term that indicates the actual amount of moisture found in the air? \na) Dew point \nb) Humidity ratio \nc) Relative humidity \nd) Wet bulb temperature \n \n7. When the temperature on two sides of a material is different, heat flows from the cooler \nside to the warmer side. \na) True \nb) False \n \n8. What is the specific heat of air at standard conditions? \na) 0.018 Btu/lb \nb) 0.2417 Btu/lb \nc) 1.01 Btu/lb \nd) 4.186 Btu/lb \n \n9. What is the danger of having too little ventilation in a dwelling? \na) Increased costs \nb) Cool and Drafty \nc) Positive building pressures \nd) A buildup of pollutants within the dwelling",
          "content_truncated": false
        },
        {
          "filename": "Module 24 Chapter 2 Answer key.pdf",
          "file_type": "pdf",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Assignments\\Answer Keys 2021",
          "char_count": 4130,
          "content": "Gas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n1 \nUnit 24 – Chapter 02: Air handling units \n \n1. What is the proper position of a gas fired duct furnace? \na) Upstream of air conditioning coil and air handling fan \nb) Downstream of air conditioning coil and air handling fan \nc) Upstream of air conditioning coil and downstream of air handling fan \nd) Downstream of air conditioning coil and upstream of air handling fan \n \n2. If multiple separately controlled and sequenced duct furnaces are installed in series within \nthe same duct, the upstream duct furnaces must operate before the downstream duct \nfurnaces. \na) True \nb) False \n \n3. A radial duct system can be used to increase headroom in a basement. \na) True \nb) False \n \n4. On individual return air systems, what is usually done to ensure less resistance to air flow in \nthe return system? \na) Undercut doors \nb) Slightly larger return air ducts \nc) Slightly smaller return air ducts \nd) Include return air grilles in rooms without supply air \n \n5. Paint can make flexible duct connectors rigid and prevent them from absorbing vibration. \na) True \nb) False\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n2 \n6. What would indicate internal blockages may be present with a duct furnace? cycling on and \noff due to the operation of the high temperature limit control or incorrect temperature rise \nacross the heat exchanger. \na) Increased CFM \nb) Decreased temperature rise \nc) Increase motor current draw \nd) Cycling on and off on high limit \n \n7. If the blower in a forced-air distribution system moves 2100 cfm of air through a 24 inch x \n18 inch duct? \na) 58 ft/min \nb) 420 ft/min \nc) 700 ft/min \nd) 1000 ft/min \n \n8. Select the statement that best defines velocity pressure. \na) Decrease in air pressure caused by friction \nb) Pressure that is created by the air movement  \nc) Pressure against which the blower has to work \nd) Air pressure in the duct at right angles to the direction of air flow \n \n9. Where is the lowest air pressure in the ductwork of a forced air heating system? \na) On the supply side after the cooling coil \nb) On the return side upstream of the filter \nc) On the return side between the furnace and the filter \nd) On the supply side between the furnace and the cooling coil \n \n10. If the flanges are closed on an adjustable motor pulley, what happens to the belt and pulley? \na) Belt is raised and pulley diameter gets larger \nb) Belt is raised and pulley diameter gets smaller \nc) Belt is lowered and pulley diameter gets larger \nd) Belt is lowered and pulley diameter gets smaller\nGas Trade Training – Chapter Questions \nUpdated: November 2019 \n \n \n© 2019 Canadian Standards Association \n \n3 \n11. If the motor pulley is increased to twice the original size, what would the blower speed be \n(in relation to the original blower speed)? \na) No change in blower speed \nb) ½ the original blower speed \nc) Twice the original blower speed \nd) Four times the original blower speed \n \n12. If a larger diameter blower pulley is installed, what will happen to air flow and to \ntemperature rise across the heat exchanger? \na) Air flow would increase and temperature rise would decrease \nb) Air flow would decrease and temperature rise would increase \nc) Air flow would increase and temperature rise would increase \nd) Air flow would decrease and temperature rise would decrease \n \n13. If the fan compartment door on a forced air furnace is left off, what is the effect the blower \nmotor? \na) Less work done by motor so current decreases \nb) Less work done by motor so current increases  \nc) More work done by motor so current increases  \nd) More work done by motor so current decreases \n \n14. A PSC motor with multiple windings gets lower efficiency at lower speeds \na) True \nb) False \n \n15. An ECM maintains an efficiency range between 60% and 80%for all speeds \na) True \nb) False \n \n16. Calculate the air velocity for a velocity pressure reading of 0.04 inches of w.c. \na) 566 ft/min \nb) 801 ft/min \nc) 1132 ft/min \nd) 1602 ft/min",
          "content_truncated": false
        },
        {
          "filename": "Blower Replacement Practical.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Lab Practicals",
          "char_count": 2826,
          "content": "Blower Replacement Practical\nLearning Outcome:\nUpon completion of this shop project, you will understand how to remove the blower housing from a furnace, remove and replace the motor, and then reinstall the blower housing.\nInstructions:\nVerify with the instructor which furnace to work on. Follow the steps below to complete the removal, replacement, and reinstallation of a motor.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\n*** Test blower function before disassembly if it is in a installed furnace. ***\nIs the furnace for the lab installed?  Yes / No \tDid the fan run properly?  Yes / No\nBrand of furnace: ___________________________\nModel #: _____________________________________\nSerial #: _____________________________________\nWhat type of blower motor is it? ___________________________\nBlower horsepower: ___________________________\nBlower FLA amperage: ___________________________\nBlower RLA amperage: ___________________________\nWhat is the difference between the RLA and FLA? (2 marks)\n_____________________________________________________________________________________\n_____________________________________________________________________________________\n_____________________________________________________________________________________\nHow is a capacitor safely discharged? (2 marks)\n_____________________________________________________________________________________\n_____________________________________________________________________________________\nCapacitor Testing:\nIf the motor HAS a capacitor, remove the motor leads, and safely discharge the capacitor.       (If not, skip this section)\nWhat size capacitor is attached to the blower? ____________________\nWhat is the measured capacitance? ____________________\nIs it within allowance? ____________________\nRemove all wiring and parts needed to remove the blower.\nRemove the blower housing from the furnace.\nInstructor signature: ____________________\nRemove blower from the housing and remove the arms and belly band if they are removable. Take pictures if needed before removal to ensure the arms/band and wiring are installed back in the correct position. Verify with the instructor when complete and receive a signature to reinstall.  (5 marks)\nInstructor signature: ____________________\nReinstall the blower back in the unit housing.\nReinstall blower housing back into the furnace.\nReconnect all wires and parts back to original position. (5 marks)\nConfirm with instructor before powering up the unit.\nTurn the unit on and verify operation of the fan.\nInstructor signature: ____________________",
          "content_truncated": false
        },
        {
          "filename": "Furnace Pressures (1).docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Lab Practicals",
          "char_count": 4350,
          "content": "Furnace Air Pressure\nReadings Project\nLearning Outcome:\nIdentify normal and abnormal operating conditions associated with    a forced warm air furnace.\nInstructions:\nYou will be utilizing a manometer and furnace to measure and record air pressure readings. Testing will show normal and abnormal operating conditions at various points due to air flow restriction.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nGeneral Airflow Information:\nStatic pressure is measured to interpret airflow in a duct system. Generally, manufacturers engineering manuals rate airflow in furnaces and air handlers based on Total External Static Pressure or TESP. A typical furnace is designed to operate around 0.50 “W.C. If there is more than 0.50 inches TESP, the fan may not be moving the required air flow. You should always carefully check the fan capacity of the furnaces and air handlers you select. The pressure capacities will range from .05 ‐ to 1.0 “W.C.\nStatic Pressure Testing:\nTo determine the TESP of a furnace you first measure the supply (+positive) pressure. This should be near the discharge of the unit, between the furnace and AC coil (test point C). Next, you measure the return (–negative) pressure. This should be near the inlet of the unit, often between the filter and the furnace (test point B). Now take the two pressures and add them together to determine the system’s TESP. When adding the positive and negative pressures together ignore the + and – signs. These only indicate the type of pressure measured. Compare the measured TESP to the rated pressure found on the appliance rating plate or in the manual.\nUsing the diagram above as a guide, attach your manometer to the system and take the required measurements. For any test points that are unclear, verify with the instructor.    (15 marks)\nWith the furnace set to heating:\nWith the furnace set to cooling:\nWith the furnace set to fan only:\nSign off: ____________________\nWhat was the Total External Static Pressure as indicated on Rating plate and how did it compare with your readings under normal and restricted conditions? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat effect would a higher vs lower fan speed, or larger vs smaller ductwork have on your readings? (2 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nPressure drop across the air filter is determined by measuring the pressure on each side of a filter and then subtracting the two pressures to find the pressure difference. Follow the table below to check the different pressure drops across the different scenarios: (9 marks)\nSign off: ____________________\nMeasured blower amperage reading with no restriction: _______________\nMeasured blower amperage reading with full restriction: _______________\nWhat effect did a blocked filter have on the operation of the furnace? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat effect did a blocked filter have on the amperage draw of the blower motor? (2 marks)\n___________________________________________________________________________\nPressure drop across the coil is determined by measuring the pressure on each side of the coil and then subtracting one pressure from the other to find the pressure difference. Coil pressure drop can be compared to the manufacturer’s rated coil pressure drop at current airflow to determine if coil is clean. Follow the table below to check the different pressure drops across the different scenarios: (9 marks)\nSign off: ____________________",
          "content_truncated": false
        },
        {
          "filename": "Furnace Pressures Practical.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Lab Practicals",
          "char_count": 4089,
          "content": "Furnace Air Pressure\nReadings Project\nLearning Outcome:\nIdentify normal and abnormal operating conditions associated with    a forced warm air furnace.\nInstructions:\nYou will be utilizing a manometer and furnace to measure and record air pressure readings. Testing will show normal and abnormal operating conditions at various points due to air flow restriction.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (5 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nStatic Pressure Testing:\nTo determine the TESP of a furnace, you must measure the supply (positive) pressure, and the return (negative) pressure. The supply must be measured near the discharge of the unit, after the AC coil (test point D). The return must be measured near the inlet of the unit, before the filter (test point A). Now take the two measurements and add them together (ignore the + and –) to determine the system’s TESP. Compare the measured TESP to the rated pressure found on the appliance rating plate or in the manual.\nUsing the diagram above as a guide, attach your manometer to the system and take the required measurements. For any test points that are unclear, verify with the instructor.    (15 marks per table)\nHeating\nCooling\nFan Only\nSign off: ____________________\nWhat type of blower is installed in this furnace? ______________________________\nWhat was the Total External Static Pressure as indicated on Rating plate and how did it compare with your readings under normal and restricted conditions? (2 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat effect would a higher vs lower fan speed, or larger vs smaller ductwork have on your readings? (2 marks)\n_______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nPressure drop across the air filter is determined by measuring the pressure on each side of a filter and then subtracting the two pressures to find the difference. Follow the table below to check the different pressure drops across the different scenarios: (9 marks)\nSign off: ____________________\nMeasured blower amperage reading with no restriction: _______________\nMeasured blower amperage reading with full restriction: _______________\nWhat effect did a blocked filter have on the operation of the furnace? (2 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat effect did a blocked filter have on the amperage draw of the blower motor? (2 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nPressure drop across the coil is determined by measuring the pressure on each side of the coil and then subtracting the two pressures to find the difference. This measurement can be compared to the manufacturer’s rated pressure to determine if the coil is clean. Follow the table below to check the different pressure drops across the different scenarios: (9 marks)\nSign off: ____________________",
          "content_truncated": false
        },
        {
          "filename": "Furnace Pressures.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Lab Practicals",
          "char_count": 4250,
          "content": "Furnace Air Pressure\nReadings Project\nLearning Outcome:\nIdentify normal and abnormal operating conditions associated with    a forced warm air furnace.\nInstructions:\nYou will be utilizing a manometer and furnace to measure and record air pressure readings. Testing will show normal and abnormal operating conditions at various points due to air flow restriction.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nGeneral Airflow Information:\nStatic pressure is measured to interpret airflow in a duct system. Generally, manufacturers engineering manuals rate airflow in furnaces and air handlers based on Total External Static Pressure or TESP. A typical furnace is designed to operate around 0.50 “W.C. If there is more than 0.50 inches TESP, the fan may not be moving the required air flow. You should always carefully check the fan capacity of the furnaces and air handlers you select. The pressure capacities will range from .05 ‐ to 1.0 “W.C.\nStatic Pressure Testing:\nTo determine the TESP of a furnace you first measure the supply (+positive) pressure. This should be near the discharge of the unit, between the furnace and AC coil (test point C). Next, you measure the return (–negative) pressure. This should be near the inlet of the unit, often between the filter and the furnace (test point B). Now take the two pressures and add them together to determine the system’s TESP. When adding the positive and negative pressures together ignore the + and – signs. These only indicate the type of pressure measured. Compare the measured TESP to the rated pressure found on the appliance rating plate or in the manual.\nUsing the diagram above as a guide, attach your manometer to the system and take the required measurements. For any test points that are unclear, verify with the instructor.    (15 marks)\nSign off: ____________________\nWhat was the Total External Static Pressure as indicated on Rating plate and how did it compare with your readings under normal and restricted conditions? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat effect would a higher vs lower fan speed, or larger vs smaller ductwork have on your readings? (2 marks)\n____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nPressure drop across the air filter is determined by measuring the pressure on each side of a filter and then subtracting the two pressures to find the pressure difference. Follow the table below to check the different pressure drops across the different scenarios: (9 marks)\nSign off: ____________________\nMeasured blower amperage reading with no restriction: _______________\nMeasured blower amperage reading with full restriction: _______________\nWhat effect did a blocked filter have on the operation of the furnace? (2 marks)\n_________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nWhat effect did a blocked filter have on the amperage draw of the blower motor? (2 marks)\n___________________________________________________________________________\nPressure drop across the coil is determined by measuring the pressure on each side of the coil and then subtracting one pressure from the other to find the pressure difference. Coil pressure drop can be compared to the manufacturer’s rated coil pressure drop at current airflow to determine if coil is clean. Follow the table below to check the different pressure drops across the different scenarios: (9 marks)\nSign off: ____________________",
          "content_truncated": false
        },
        {
          "filename": "PSC Motor Taps Practical.docx",
          "file_type": "word",
          "relative_path": "CSA Units\\Unit 24 - Air Handling\\Lab Practicals",
          "char_count": 2976,
          "content": "PSC Motor Taps Practical\nLearning Outcome:\nUpon completion of this shop project, you will understand the different wiring connections of a PSC blower, and how to test the capacitor associated with it.\nInstructions:\nCAREFULLY using the blower board and an electrical meter, complete the following questions.\nNote: Each step must be signed off by the instructor before proceeding to the next question. Skipped sign offs will result in lost marks (2 per). Any damage to the systems components due to negligence or horseplay will result in a mark of zero for the practical.\nFollow all shop safety rules.\nWithout energizing the motor answer the following questions:\nWhat is the horsepower of the motor? ____________________\nHow many speed taps does the motor have? ____________________\nList the motor tap colours with the corresponding speed: (5 marks)\n______________________________________________________________________________________________________________________________________________________\nWhat are the resistances of the different speed taps to neutral? (3 marks)\n______________________________________________________________________________________________________________________________________________________\nHow is a capacitor safely discharged? (2 marks)\n______________________________________________________________________________________________________________________________________________________\nInstructor signature: ____________________\nRemove the capacitor motor leads and safely discharge the capacitor.\nWhat size capacitor is attached to the blower? ____________________\nWhat is the measured capacitance? ____________________\nIs it within allowance? ____________________\nReconnect the capacitor motor leads once readings are taken and connect the supplied plug end to the speed taps. Verify wiring with the instructor to receive a sign off and then power the unit. Any damage to the blower due to premature start-up will result in a zero.\nInstructor signature: ____________________\nEnergize the motor and answer the following questions:\nWhat are the different amperages for each speed tap? (3 marks)\n______________________________________________________________________________________________________________________________________________________\nSelect any speed tap, connect it to the main power and run the fan. Verify the voltage of the other speed taps to ground. Record your findings below: (2 marks)\n______________________________________________________________________________________________________________________________________________________\nWhat is the voltage called, found on the unconnected speed taps? ____________________\nWhat can be done to the unused speed taps to ensure they do not ground to the furnace body? (2 marks)\n______________________________________________________________________________________________________________________________________________________\nInstructor signature: ____________________",
          "content_truncated": false
        }
      ]
    }
  }
}